README.org
# Hey Emacs, this is a -*- org -*- file ...
#+TITLE:     Refcard SQL
#+AUTHOR:    Fabrice Niessen
#+EMAIL:     (concat "fniessen" at-sign "pirilampo.org")
#+DESCRIPTION:
#+KEYWORDS:  sql, emacs, yasnippet, snippets, code templates
#+LANGUAGE:  en
#+OPTIONS:   H:4 num:nil toc:3
#+EXCLUDE_TAGS: noexport

#+PROPERTY:  header-args :eval never :padline no :tangle yes

#+SETUPFILE: ~/.dotfiles/org/theme-readtheorg.setup

* Tasks                                                               :noexport:

** TODO Watch video of SQL Prompt

http://www.red-gate.com/products/sql-development/sql-prompt/

** TODO Look at RedGate snippets

=/cygdrive/c/Users/f.niessen/AppData/Local/Red Gate/SQL Prompt 7/Snippets/=

** TODO Look at SQL Query syntax checker & validator

https://www.eversql.com/sql-syntax-check-validator/

