README.org
* Sqsh

#+name: current-year
#+begin_src emacs-lisp :eval yes :results silent :tangle no :exports none
(format-time-string "%Y")
#+end_src

#+begin_src conf :tangle ~/.dotfiles/home/.sqshrc
# Hey Emacs, this is a -*- conf -*- file
## .sqshrc - My sqsh initialization file

# Copyright (C) 2010-<<current-year()>> Fabrice Niessen

# Author: Fabrice Niessen <(concat "fni" at-symbol "pirilampo.org")>
# Keywords: sqsh, dotfile, config

#* Connections

# Setting your password within your `.sqshrc' is probably the most secure method
# of using sqsh.  However, make sure that you `chmod go-rwx ~/.sqshrc',
# otherwise you leave yourself wide open to attacks.

\set username="sa"
\set password="mysecret"
\set hostname="localhost"
\set database=[ARCHIBUS_23_2_HQ]

#* Aliasing

#** Display styles

# \set colsep='| '

# Currently supported styles are:
# - horiz (or hor or horizontal) (*) = default
# - vert (or vertical) (*),
# - bcp,
# - csv,
# - html,
# - meta,
# - pretty (*), and
# - none.

\alias goh='\go -m horiz | ${PAGER}'

\alias gov='\go -m vert | ${PAGER}'

# *Very* useful for doing quick bcp commands from command line, and using
# re-direction directly to a file!
\alias gob='\go -m bcp | ${PAGER}'

# Firefox.
\alias gof='\go -m html | (cat > /tmp/sqsh-output.html; /mnt/c/Windows/explorer.exe file:///tmp/sqsh-output.html)'

\alias gom='\go -m meta | ${PAGER}'

\alias gop='\go -m pretty -w80 | ${PAGER}'

#** Aliases for T-SQL commands
#+end_src

#+begin_src conf :tangle ~/.dotfiles/home/.sqshrc
\alias statson='\loop -e "SET STATISTICS IO ON; SET STATISTICS TIME ON;"'
\alias statsoff='\loop -e "SET STATISTICS IO OFF; SET STATISTICS TIME OFF;"'
#+end_src

SQL Server Execution Time: This refers to the time taken by SQL server to
complete the execution of the compiled plan.

*CPU time* refers to the actual time spent on CPU.

The *elapsed time* is the total time to complete the execution which includes
- signal wait time,
- wait time to complete the IO operation and
- time taken to transfer the output to the client.

*CPU time* is really where you want to pay attention for *performance tuning*, as it
can be
- higher than the *elapsed time* if the query goes parallel, or
- lower if the procedure spends time sleeping on wait signals and I/O
  operations.

The *CPU time* can be used to baseline the performance tuning. This value will not
vary much from execution to execution unless you modify the query or data. The
load on the server will not impact much on this value.

The *elapsed time* will depend on many factors, like load on the server, IO load,
network bandwidth between server and client.

So always use the CPU time as baseline while doing the performance tuning.

Want to *format your output* online in a web browser?  The [[http://statisticsparser.com/index.html][Statistics Parser]] will
help with that. Just paste in the output of Statistics IO and/or Statistics Time
and press Parse. Your output will be formatted and totaled. Enjoy.

#+begin_src conf :tangle ~/.dotfiles/home/.sqshrc
\alias planon='\loop -e "SET SHOWPLAN ON"'
\alias planoff='\loop -e "SET SHOWPLAN OFF"'

\alias ton='\loop -e "DBCC TRACEON(3604)"'
\alias toff='\loop -e "DBCC TRACEOFF(3604)"'

\alias tempdb='\loop -e "USE tempdb"'
\alias master='\loop -e "USE master"'

#** Aliases for sqsh commands

\alias DEV='\reconnect -SDEV -Usa -Pmysecret'
\alias STG='\reconnect -SSTG -Usa -Pmysecret'
\alias PRD='\reconnect -c -SPRD -Usa -Pmysecret'

# Clear screen within sqsh session.
\alias clear="\shell clear"

# Read a file into sqsh session.
\alias :r='\buf-load -a !*'
\alias r="\buf-load "

# Drop you into a shell out of sqsh.
\alias sh="\shell "

\alias h="\history"

\alias xx='\reset'

\alias q="\exit"

#* Miscellaneous

# Turn off the sqsh banner; cosmetic only
\set banner=no

\set width=65535

# Have semicolons executing commands (sort of inline "go")...
\set semicolon_hack=on

# Turn on ability to have !-recall commands.
\set history_shorthand=on

# This variable causes sqsh to exit with an exit status of the total number of
# batches that failed during the current session.  This is useful for use within
# shell scripts and the such.
\set exit_failcount=on

\set prompt_color='{0;34;47}'
\set text_color='{0;33}'
\set prompt='$prompt_color{{$username@$DSQUERY:$database}}>$text_color '

# This is for the sake of Emacs.
# Local Variables:
# mode: outline-minor
# End:

## .sqshrc ends here
#+end_src

