README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Refcard SQL</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Fabrice Niessen" />
<meta name="keywords" content="sql, emacs, yasnippet, snippets, code templates" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Refcard SQL</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org95eb27d">Sqsh</a></li>
<li><a href="#org170cf74">Mssql-cli</a>
<ul>
<li><a href="#orge27403f">Features</a></li>
<li><a href="#org3a23f6e">Setup</a></li>
</ul>
</li>
<li><a href="#org87b890c">Emacs YASnippets</a>
<ul>
<li><a href="#org8e54931">Insert Snippet&#x2026;</a>
<ul>
<li><a href="#org01d2ff8">Cursor</a></li>
<li><a href="#orgbfd798b">Database</a></li>
<li><a href="#org5ef02b1">Fragment</a></li>
<li><a href="#org0222e26">Function</a></li>
<li><a href="#orge7a2ebe">Help</a></li>
<li><a href="#orga57cddb">Index</a></li>
<li><a href="#org7bfe62f">Join fragment</a></li>
<li><a href="#org373e108">Login</a></li>
<li><a href="#org88ba6af">Role</a></li>
<li><a href="#org95b3c96">Schema</a></li>
<li><a href="#orgb10fb41">Set options</a></li>
<li><a href="#org1087bf2">Stored Procedure</a></li>
<li><a href="#org638f01f">Synonym</a></li>
<li><a href="#org20bef56">Table</a></li>
<li><a href="#orgb9c5182">Transaction</a></li>
<li><a href="#org964ea6c">Trigger</a></li>
<li><a href="#org2dcb173">User</a></li>
<li><a href="#org397641b">User Defined Data Type</a></li>
<li><a href="#orgefbf7c6">User Defined Table Type</a></li>
<li><a href="#org96565f0">User Defined Type</a></li>
<li><a href="#org1e593f2">View</a></li>
<li><a href="#orgb57a7fb">&#x2014; Miscellaneous ---</a></li>
</ul>
</li>
<li><a href="#orgd5ec54c">Surround With&#x2026;</a>
<ul>
<li><a href="#org29f6f4d">[begin] Code Snippet for BEGIN&#x2026;END block</a></li>
<li><a href="#orga446a03">[if] Code Snippet for IF construct</a></li>
<li><a href="#orgc1c6489">[while] Code Snippet for WHILE loop</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org95eb27d" class="outline-2">
<h2 id="org95eb27d">Sqsh</h2>
<div class="outline-text-2" id="text-org95eb27d">
<div class="org-src-container">
<pre class="src src-conf"><span class="org-comment-delimiter"># </span><span class="org-comment">Hey Emacs, this is a -*- conf -*- file</span>
<span class="org-comment-delimiter">## </span><span class="org-comment">.sqshrc - My sqsh initialization file</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Copyright (C) 2010-&lt;&lt;current-year()&gt;&gt; Fabrice Niessen</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Author: Fabrice Niessen &lt;(concat "fni" at-symbol "pirilampo.org")&gt;</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Keywords: sqsh, dotfile, config</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">* Connections</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Setting your password within your `.sqshrc' is probably the most secure method</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">of using sqsh.  However, make sure that you `chmod go-rwx ~/.sqshrc',</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">otherwise you leave yourself wide open to attacks.</span>

<span class="org-variable-name">\set username</span>=<span class="org-string">"sa"</span>
<span class="org-variable-name">\set password</span>=<span class="org-string">"mysecret"</span>
<span class="org-variable-name">\set hostname</span>=<span class="org-string">"localhost"</span>
<span class="org-variable-name">\set database</span>=[ARCHIBUS_23_2_HQ]

<span class="org-comment-delimiter">#</span><span class="org-comment">* Aliasing</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">** Display styles</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">\set colsep='| '</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Currently supported styles are:</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">- horiz (or hor or horizontal) (*) = default</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">- vert (or vertical) (*),</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">- bcp,</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">- csv,</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">- html,</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">- meta,</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">- pretty (*), and</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">- none.</span>

<span class="org-variable-name">\alias goh</span>=<span class="org-string">'\go -m horiz | ${PAGER}'</span>

<span class="org-variable-name">\alias gov</span>=<span class="org-string">'\go -m vert | ${PAGER}'</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">*Very* useful for doing quick bcp commands from command line, and using</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">re-direction directly to a file!</span>
<span class="org-variable-name">\alias gob</span>=<span class="org-string">'\go -m bcp | ${PAGER}'</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Firefox.</span>
<span class="org-variable-name">\alias gof</span>=<span class="org-string">'\go -m html | (cat &gt; /tmp/sqsh-output.html; /mnt/c/Windows/explorer.exe file:///tmp/sqsh-output.html)'</span>

<span class="org-variable-name">\alias gom</span>=<span class="org-string">'\go -m meta | ${PAGER}'</span>

<span class="org-variable-name">\alias gop</span>=<span class="org-string">'\go -m pretty -w80 | ${PAGER}'</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">** Aliases for T-SQL commands</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-conf"><span class="org-variable-name">\alias statson</span>=<span class="org-string">'\loop -e "SET STATISTICS IO ON; SET STATISTICS TIME ON;"'</span>
<span class="org-variable-name">\alias statsoff</span>=<span class="org-string">'\loop -e "SET STATISTICS IO OFF; SET STATISTICS TIME OFF;"'</span>
</pre>
</div>

<p>
SQL Server Execution Time: This refers to the time taken by SQL server to
complete the execution of the compiled plan.
</p>

<p>
<b>CPU time</b> refers to the actual time spent on CPU.
</p>

<p>
The <b>elapsed time</b> is the total time to complete the execution which includes
</p>
<ul class="org-ul">
<li>signal wait time,</li>
<li>wait time to complete the IO operation and</li>
<li>time taken to transfer the output to the client.</li>
</ul>

<p>
<b>CPU time</b> is really where you want to pay attention for <b>performance tuning</b>, as it
can be
</p>
<ul class="org-ul">
<li>higher than the <b>elapsed time</b> if the query goes parallel, or</li>
<li>lower if the procedure spends time sleeping on wait signals and I/O
operations.</li>
</ul>

<p>
The <b>CPU time</b> can be used to baseline the performance tuning. This value will not
vary much from execution to execution unless you modify the query or data. The
load on the server will not impact much on this value.
</p>

<p>
The <b>elapsed time</b> will depend on many factors, like load on the server, IO load,
network bandwidth between server and client.
</p>

<p>
So always use the CPU time as baseline while doing the performance tuning.
</p>

<p>
Want to <b>format your output</b> online in a web browser?  The <a href="http://statisticsparser.com/index.html">Statistics Parser</a> will
help with that. Just paste in the output of Statistics IO and/or Statistics Time
and press Parse. Your output will be formatted and totaled. Enjoy.
</p>

<div class="org-src-container">
<pre class="src src-conf"><span class="org-variable-name">\alias planon</span>=<span class="org-string">'\loop -e "SET SHOWPLAN ON"'</span>
<span class="org-variable-name">\alias planoff</span>=<span class="org-string">'\loop -e "SET SHOWPLAN OFF"'</span>

<span class="org-variable-name">\alias ton</span>=<span class="org-string">'\loop -e "DBCC TRACEON(3604)"'</span>
<span class="org-variable-name">\alias toff</span>=<span class="org-string">'\loop -e "DBCC TRACEOFF(3604)"'</span>

<span class="org-variable-name">\alias tempdb</span>=<span class="org-string">'\loop -e "USE tempdb"'</span>
<span class="org-variable-name">\alias master</span>=<span class="org-string">'\loop -e "USE master"'</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">** Aliases for sqsh commands</span>

<span class="org-variable-name">\alias DEV</span>=<span class="org-string">'\reconnect -SDEV -Usa -Pmysecret'</span>
<span class="org-variable-name">\alias STG</span>=<span class="org-string">'\reconnect -SSTG -Usa -Pmysecret'</span>
<span class="org-variable-name">\alias PRD</span>=<span class="org-string">'\reconnect -c -SPRD -Usa -Pmysecret'</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Clear screen within sqsh session.</span>
<span class="org-variable-name">\alias clear</span>=<span class="org-string">"\shell clear"</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Read a file into sqsh session.</span>
<span class="org-variable-name">\alias :r</span>=<span class="org-string">'\buf-load -a !*'</span>
<span class="org-variable-name">\alias r</span>=<span class="org-string">"\buf-load "</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Drop you into a shell out of sqsh.</span>
<span class="org-variable-name">\alias sh</span>=<span class="org-string">"\shell "</span>

<span class="org-variable-name">\alias h</span>=<span class="org-string">"\history"</span>

<span class="org-variable-name">\alias xx</span>=<span class="org-string">'\reset'</span>

<span class="org-variable-name">\alias q</span>=<span class="org-string">"\exit"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">* Miscellaneous</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Turn off the sqsh banner; cosmetic only</span>
<span class="org-variable-name">\set banner</span>=no

<span class="org-variable-name">\set width</span>=65535

<span class="org-comment-delimiter"># </span><span class="org-comment">Have semicolons executing commands (sort of inline "go")...</span>
<span class="org-variable-name">\set semicolon_hack</span>=on

<span class="org-comment-delimiter"># </span><span class="org-comment">Turn on ability to have !-recall commands.</span>
<span class="org-variable-name">\set history_shorthand</span>=on

<span class="org-comment-delimiter"># </span><span class="org-comment">This variable causes sqsh to exit with an exit status of the total number of</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">batches that failed during the current session.  This is useful for use within</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">shell scripts and the such.</span>
<span class="org-variable-name">\set exit_failcount</span>=on

<span class="org-variable-name">\set prompt_color</span>=<span class="org-string">'{0;34;47}'</span>
<span class="org-variable-name">\set text_color</span>=<span class="org-string">'{0;33}'</span>
<span class="org-variable-name">\set prompt</span>=<span class="org-string">'$prompt_color{{$username@$DSQUERY:$database}}&gt;$text_color '</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">This is for the sake of Emacs.</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Local Variables&#58;</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">mode: outline-minor</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">End:</span>

<span class="org-comment-delimiter">## </span><span class="org-comment">.sqshrc ends here</span>
</pre>
</div>
</div>
</div>
