README.org
* Mssql-cli

** Features

New and interactive command line query tool for SQL Server. This open source
tool works cross-platform and is a proud member of the dbcli community.

Features
- Mssql-cli auto-completion that is context aware
- T-SQL IntelliSense
- Syntax highlighting
- Pretty formatting for query results, including Vertical Format
- Multi-line edit mode
- Configuration file support

https://cloudblogs.microsoft.com/sqlserver/2017/12/12/try-mssql-cli-a-new-interactive-command-line-tool-for-sql-server/

** Setup

#+begin_src shell :tangle no
sudo apt install python-pip python-dev
sudo pip install --upgrade pip
sudo pip install mssql-cli
#+end_src

#+begin_src shell :tangle no
mssql-cli -E
kinit.exe user@domain.com
#+end_src

* Emacs YASnippets

A *SQL "snippet"* (or *auto-replacement*) is a frequently used *code template* which
can be inserted into a code you are typing by pressing the TAB key.  It allows
you to write frequently used SQL commands more quickly.

Snippets are categorized into 2 types:

- *Insert Snippets (or Expansion Snippets)*: These are code templates for various
  SQL commands you can quickly insert into your SQL code when creating tables,
  stored procedures, triggers and so on.

- *Surround Snippets:* These are code templates that help you implement code
  constructs such as ~BEGIN...END~, ~IF~, ~WHILE~ and so on.

See https://github.com/gvohra/sqlpromptsnippets or sharing the best Red Gate SQL
Prompt snippets.

https://www.ssmsboost.com/

https://www.ssmstoolspack.com/Download

** Insert Snippet...

*** Cursor

**** [curff] Cursor Fast-Forward

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/curff.yasnippet
# name: Fast-forward read-on...
# --
/* declare variables */
DECLARE @variable INT

DECLARE ${1:cursor_name} CURSOR
FAST_FORWARD READ_ONLY
FOR ${2:select_statement}

OPEN $1

FETCH NEXT FROM $1
INTO @variable

WHILE @@FETCH_STATUS = 0
BEGIN
    $0

    FETCH NEXT FROM $1
    INTO @variable
END

CLOSE $1
DEALLOCATE $1
go
#+end_src

*** Database

**** [cdb] Create DataBase

Create database.

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/cdb.yasnippet
# name: Create database
# --
USE master
go

-- Drop the database if it already exists.
IF EXISTS (SELECT name
        FROM sys.databases
        WHERE name = N'${1:database_name}')
    DROP DATABASE $1
go

CREATE DATABASE $1
ON
PRIMARY ( -- or use FILEGROUP filegroup_name
  NAME = $1_data,
  FILENAME = '$1.mdf'
) --, and repeat as required
LOG ON
(
  NAME = $1_log,
  FILENAME = '$1.ldf'
) --, and repeat as required
--COLLATE collation_name
--WITH
--  DB_CHAINING ON/OFF
--  TRUSTWORTHY ON/OFF
--FOR LOAD
--FOR ATTACH
--WITH
--  ENABLE_BROKER
--  NEW_BROKER
--  ERROR_BROKER_CONVERSATIONS
--FOR ATTACH_REBUILD_LOG
go
#+end_src

**** [cdbsnap] Create DataBase Snapshot

Create snapshot.

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/cdbsnap.yasnippet
# name: Create database sna...
# --
USE master
go

-- Drop snapshot database if it already exists.
IF EXISTS (SELECT name
        FROM sys.databases
        WHERE name = N'${1:source_database}_${2:snapshot_id}')
    DROP DATABASE $1_$2
go

-- Create the snapshot database.
CREATE DATABASE $1_$2 ON
( NAME = $1_$2_data,
  FILENAME = '$1_$2.ss')
AS SNAPSHOT OF $1;
go$0
#+end_src

**** [dd] Drop Database

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/dd.yasnippet
# name: Drop database
# --
USE master
go

-- Drop the database if it already exists.
IF EXISTS (SELECT name
        FROM sys.databases
        WHERE name = N'${1:database_name}')
    DROP DATABASE $1
go
#+end_src

**** Database Backup

Backup database.

#+begin_src sql :tangle no
# name: Backup database
# --
BACKUP DATABASE ${1:database_name}
    TO DISK = N'Backup_Path/$1.bak'
WITH
    NOFORMAT,
    NOINIT,
    NAME = N'$1-Full Database Backup',
    SKIP,
    STATS = 10;
go
#+end_src

**** Database Restore

Restore database.

#+begin_src sql :tangle no
# name: Restore database
# --
USE master
go

RESTORE DATABASE ${1:database_name}
    FROM DISK = N'Backup_Path/$1.bak'
WITH
    FILE = 1,
    NOUNLOAD,
    REPLACE,
    STATS = 10
go
#+end_src

*** Fragment

