README.html

<div id="outline-container-org170cf74" class="outline-2">
<h2 id="org170cf74">Mssql-cli</h2>
<div class="outline-text-2" id="text-org170cf74">
</div>
<div id="outline-container-orge27403f" class="outline-3">
<h3 id="orge27403f">Features</h3>
<div class="outline-text-3" id="text-orge27403f">
<p>
New and interactive command line query tool for SQL Server. This open source
tool works cross-platform and is a proud member of the dbcli community.
</p>

<p>
Features
</p>
<ul class="org-ul">
<li>Mssql-cli auto-completion that is context aware</li>
<li>T-SQL IntelliSense</li>
<li>Syntax highlighting</li>
<li>Pretty formatting for query results, including Vertical Format</li>
<li>Multi-line edit mode</li>
<li>Configuration file support</li>
</ul>

<p>
<a href="https://cloudblogs.microsoft.com/sqlserver/2017/12/12/try-mssql-cli-a-new-interactive-command-line-tool-for-sql-server/">https://cloudblogs.microsoft.com/sqlserver/2017/12/12/try-mssql-cli-a-new-interactive-command-line-tool-for-sql-server/</a>
</p>
</div>
</div>

<div id="outline-container-org3a23f6e" class="outline-3">
<h3 id="org3a23f6e">Setup</h3>
<div class="outline-text-3" id="text-org3a23f6e">
<div class="org-src-container">
<pre class="src src-shell">sudo apt install python-pip python-dev
sudo pip install --upgrade pip
sudo pip install mssql-cli
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">mssql-cli -E
kinit.exe user@domain.com
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org87b890c" class="outline-2">
<h2 id="org87b890c">Emacs YASnippets</h2>
<div class="outline-text-2" id="text-org87b890c">
<p>
A <b>SQL &ldquo;snippet&rdquo;</b> (or <b>auto-replacement</b>) is a frequently used <b>code template</b> which
can be inserted into a code you are typing by pressing the TAB key.  It allows
you to write frequently used SQL commands more quickly.
</p>

<p>
Snippets are categorized into 2 types:
</p>

<ul class="org-ul">
<li><b>Insert Snippets (or Expansion Snippets)</b>: These are code templates for various
SQL commands you can quickly insert into your SQL code when creating tables,
stored procedures, triggers and so on.</li>

<li><b>Surround Snippets:</b> These are code templates that help you implement code
constructs such as <code>BEGIN...END</code>, <code>IF</code>, <code>WHILE</code> and so on.</li>
</ul>

<p>
See <a href="https://github.com/gvohra/sqlpromptsnippets">https://github.com/gvohra/sqlpromptsnippets</a> or sharing the best Red Gate SQL
Prompt snippets.
</p>

<p>
<a href="https://www.ssmsboost.com/">https://www.ssmsboost.com/</a>
</p>

<p>
<a href="https://www.ssmstoolspack.com/Download">https://www.ssmstoolspack.com/Download</a>
</p>
</div>

<div id="outline-container-org8e54931" class="outline-3">
<h3 id="org8e54931">Insert Snippet&#x2026;</h3>
<div class="outline-text-3" id="text-org8e54931">
</div>
<div id="outline-container-org01d2ff8" class="outline-4">
<h4 id="org01d2ff8">Cursor</h4>
<div class="outline-text-4" id="text-org01d2ff8">
</div>
<div id="outline-container-org603325d" class="outline-5">
<h5 id="org603325d">[curff] Cursor Fast-Forward</h5>
<div class="outline-text-5" id="text-org603325d">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: Fast-forward <span class="org-keyword">read</span>-<span class="org-keyword">on</span>...
# <span class="org-comment">--</span>
<span class="org-comment-delimiter">/* </span><span class="org-comment">declare variables */</span>
<span class="org-keyword">DECLARE</span> <span class="org-variable-name">@variable</span> <span class="org-type">INT</span>

<span class="org-keyword">DECLARE</span> ${1:<span class="org-keyword">cursor_name</span>} <span class="org-type">CURSOR</span>
FAST_FORWARD READ_ONLY
<span class="org-keyword">FOR</span> ${2:select_statement}

<span class="org-keyword">OPEN</span> $1

<span class="org-keyword">FETCH</span> <span class="org-keyword">NEXT</span> <span class="org-keyword">FROM</span> $1
<span class="org-keyword">INTO</span> <span class="org-variable-name">@variable</span>

<span class="org-keyword">WHILE</span> <span class="org-builtin">@@FETCH_STATUS</span> = 0
<span class="org-keyword">BEGIN</span>
    $0

    <span class="org-keyword">FETCH</span> <span class="org-keyword">NEXT</span> <span class="org-keyword">FROM</span> $1
    <span class="org-keyword">INTO</span> <span class="org-variable-name">@variable</span>
<span class="org-keyword">END</span>

<span class="org-keyword">CLOSE</span> $1
<span class="org-keyword">DEALLOCATE</span> $1
<span class="org-doc">go</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgbfd798b" class="outline-4">
<h4 id="orgbfd798b">Database</h4>
<div class="outline-text-4" id="text-orgbfd798b">
</div>
<div id="outline-container-org4c036e9" class="outline-5">
<h5 id="org4c036e9">[cdb] Create DataBase</h5>
<div class="outline-text-5" id="text-org4c036e9">
<p>
Create database.
</p>

<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">Create</span> <span class="org-keyword">database</span>
# <span class="org-comment">--</span>
<span class="org-doc">USE master</span>
<span class="org-doc">go</span>

<span class="org-comment">-- Drop the database if it already exists.</span>
<span class="org-keyword">IF</span> <span class="org-keyword">EXISTS</span> (<span class="org-keyword">SELECT</span> <span class="org-keyword">name</span>
        <span class="org-keyword">FROM</span> sys.databases
        <span class="org-keyword">WHERE</span> <span class="org-keyword">name</span> = N<span class="org-string">'${1:database_name}'</span>)
    <span class="org-keyword">DROP</span> <span class="org-keyword">DATABASE</span> $1
<span class="org-doc">go</span>

<span class="org-keyword">CREATE</span> <span class="org-keyword">DATABASE</span> $1
<span class="org-keyword">ON</span>
<span class="org-keyword">PRIMARY</span> ( <span class="org-comment">-- or use FILEGROUP filegroup_name</span>
  <span class="org-keyword">NAME</span> = $1_data,
  FILENAME = <span class="org-string">'$1.mdf'</span>
) <span class="org-comment">--, and repeat as required</span>
<span class="org-builtin">LOG</span> <span class="org-keyword">ON</span>
(
  <span class="org-keyword">NAME</span> = $1_log,
  FILENAME = <span class="org-string">'$1.ldf'</span>
) <span class="org-comment">--, and repeat as required</span>
<span class="org-comment">--COLLATE collation_name</span>
<span class="org-comment">--WITH</span>
<span class="org-comment">--  DB_CHAINING ON/OFF</span>
<span class="org-comment">--  TRUSTWORTHY ON/OFF</span>
<span class="org-comment">--FOR LOAD</span>
<span class="org-comment">--FOR ATTACH</span>
<span class="org-comment">--WITH</span>
<span class="org-comment">--  ENABLE_BROKER</span>
<span class="org-comment">--  NEW_BROKER</span>
<span class="org-comment">--  ERROR_BROKER_CONVERSATIONS</span>
<span class="org-comment">--FOR ATTACH_REBUILD_LOG</span>
<span class="org-doc">go</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8a585e2" class="outline-5">
<h5 id="org8a585e2">[cdbsnap] Create DataBase Snapshot</h5>
<div class="outline-text-5" id="text-org8a585e2">
<p>
Create snapshot.
</p>

<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">Create</span> <span class="org-keyword">database</span> sna...
# <span class="org-comment">--</span>
<span class="org-doc">USE master</span>
<span class="org-doc">go</span>

<span class="org-comment">-- Drop snapshot database if it already exists.</span>
<span class="org-keyword">IF</span> <span class="org-keyword">EXISTS</span> (<span class="org-keyword">SELECT</span> <span class="org-keyword">name</span>
        <span class="org-keyword">FROM</span> sys.databases
        <span class="org-keyword">WHERE</span> <span class="org-keyword">name</span> = N<span class="org-string">'${1:source_database}_${2:snapshot_id}'</span>)
    <span class="org-keyword">DROP</span> <span class="org-keyword">DATABASE</span> $1_$2
<span class="org-doc">go</span>

<span class="org-comment">-- Create the snapshot database.</span>
<span class="org-keyword">CREATE</span> <span class="org-keyword">DATABASE</span> $1_$2 <span class="org-keyword">ON</span>
( <span class="org-keyword">NAME</span> = $1_$2_data,
  FILENAME = <span class="org-string">'$1_$2.ss'</span>)
<span class="org-keyword">AS</span> SNAPSHOT <span class="org-keyword">OF</span> $1;
<span class="org-doc">go$0</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb0914ae" class="outline-5">
<h5 id="orgb0914ae">[dd] Drop Database</h5>
<div class="outline-text-5" id="text-orgb0914ae">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">Drop</span> <span class="org-keyword">database</span>
# <span class="org-comment">--</span>
<span class="org-doc">USE master</span>
<span class="org-doc">go</span>

<span class="org-comment">-- Drop the database if it already exists.</span>
<span class="org-keyword">IF</span> <span class="org-keyword">EXISTS</span> (<span class="org-keyword">SELECT</span> <span class="org-keyword">name</span>
        <span class="org-keyword">FROM</span> sys.databases
        <span class="org-keyword">WHERE</span> <span class="org-keyword">name</span> = N<span class="org-string">'${1:database_name}'</span>)
    <span class="org-keyword">DROP</span> <span class="org-keyword">DATABASE</span> $1
<span class="org-doc">go</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org4088cec" class="outline-5">
<h5 id="org4088cec">Database Backup</h5>
<div class="outline-text-5" id="text-org4088cec">
<p>
Backup database.
</p>

<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">Backup</span> <span class="org-keyword">database</span>
# <span class="org-comment">--</span>
<span class="org-keyword">BACKUP</span> <span class="org-keyword">DATABASE</span> ${1:database_name}
    <span class="org-keyword">TO</span> <span class="org-keyword">DISK</span> = N<span class="org-string">'Backup_Path/$1.bak'</span>
<span class="org-keyword">WITH</span>
    NOFORMAT,
    NOINIT,
    <span class="org-keyword">NAME</span> = N<span class="org-string">'$1-Full Database Backup'</span>,
    SKIP,
    STATS = 10;
<span class="org-doc">go</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc0e5263" class="outline-5">
<h5 id="orgc0e5263">Database Restore</h5>
<div class="outline-text-5" id="text-orgc0e5263">
<p>
Restore database.
</p>

<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">Restore</span> <span class="org-keyword">database</span>
# <span class="org-comment">--</span>
<span class="org-doc">USE master</span>
<span class="org-doc">go</span>

<span class="org-keyword">RESTORE</span> <span class="org-keyword">DATABASE</span> ${1:database_name}
    <span class="org-keyword">FROM</span> <span class="org-keyword">DISK</span> = N<span class="org-string">'Backup_Path/$1.bak'</span>
<span class="org-keyword">WITH</span>
    <span class="org-keyword">FILE</span> = 1,
    NOUNLOAD,
    <span class="org-builtin">REPLACE</span>,
    STATS = 10
<span class="org-doc">go</span>
</pre>
</div>
</div>
</div>
</div>
