README.org
**** [cr] Create

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/cr.yasnippet
# name: Create fragment
# --
CREATE $0
#+end_src

**** [i] Insert

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/i.yasnippet
# name: INSERT fragment
# --
INSERT
#+end_src

**** [ii] Insert Into

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/ii.yasnippet
# name: INSERT INTO fragment
# --
INSERT INTO $0 ()
VALUES ()
#+end_src

**** [s] Select

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/s.yasnippet
# name: SELECT fragment
# --
SELECT
#+end_src

**** [ssf] Select Star From

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/ssf.yasnippet
# name: SELECT * FROM frag...
# --
SELECT *
FROM $0
WHERE
#+end_src

**** [sst] Select Top 10

Select top 10 rows.

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/sst.yasnippet
# name: SELECT top 10 rows
# --
SELECT TOP 10 *
FROM $0
#+end_src

**** [st100] Select Top 100

Select top 100 rows.

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/st100.yasnippet
# name: SELECT top 100 rows
# --
SELECT TOP 100 *
FROM $0
#+end_src

**** [scf] Select Count From

Count number of records returned by query.

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/scf.yasnippet
# name: Count number of rec...
# --
SELECT FORMAT(COUNT(*), '#,##0')
FROM $0
#+end_src

**** [scgb] Select Count with Group By

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/scgb.yasnippet
# name: Count with group by
# --
SELECT ${1:col}, COUNT(*) FROM $0 GROUP BY $1
#+end_src

**** [num] Format Number

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/num.yasnippet
# name: Format number
# --
FORMAT($0,'#,##0')
#+end_src

**** [smf] Select Sum From

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/smf.yasnippet
# name: SELECT SUM(*) FROM...
# --
SELECT SUM($0)
FROM
#+end_src

**** [f] From

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/f.yasnippet
# name: FROM fragment
# --
FROM
#+end_src

**** [is] INFORMATION_SCHEMA

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/is.yasnippet
# name: INFORMATION_SCH...
# --
INFORMATION_SCHEMA$0
#+end_src

**** [w] Where

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/w.yasnippet
# name: WHERE fragment
# --
WHERE $0
#+end_src

**** [lk] Like

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/lk.yasnippet
# name: LIKE fragment
# --
LIKE '%$0%'
#+end_src

**** [today] Today

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/today.yasnippet
# name: Today fragment
# --
CAST(GETDATE() AS DATE)
#+end_src

**** [now] Now

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/now.yasnippet
# name: Now fragment
# --
`(format-time-string "'%Y-%m-%d %H:%M:%S.%3N'")`
#+end_src

**** [gb] Group By

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/gb.yasnippet
# name: GROUP BY fragment
# --
GROUP BY $0
#+end_src

**** [ha] Having

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/ha.yasnippet
# name: HAVING fragment
# --
HAVING
#+end_src

**** [ob] Order By

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/ob.yasnippet
# name: ORDER BY fragment
# --
ORDER BY $0
#+end_src

**** [rwn] Row Number

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/rwn.yasnippet
# name: ROW_NUMBER fragment
# --
ROW_NUMBER() OVER(PARTITION BY  ORDER BY )
#+end_src

**** [up] Update

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/up.yasnippet
# name: UPDATE fragment
# --
UPDATE $0
#+end_src

**** [upd] Update

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/upd.yasnippet
# name: UPDATE fragment
# --
UPDATE $0
SET
WHERE
#+end_src

**** [d] Delete

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/d.yasnippet
# name: DELETE frag...
# --
DELETE
#+end_src

