README.html

<div id="outline-container-org5ef02b1" class="outline-4">
<h4 id="org5ef02b1">Fragment</h4>
<div class="outline-text-4" id="text-org5ef02b1">
</div>
<div id="outline-container-orgff7d4f4" class="outline-5">
<h5 id="orgff7d4f4">[cr] Create</h5>
<div class="outline-text-5" id="text-orgff7d4f4">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">Create</span> fragment
# <span class="org-comment">--</span>
<span class="org-keyword">CREATE</span> $0
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc0e61b2" class="outline-5">
<h5 id="orgc0e61b2">[i] Insert</h5>
<div class="outline-text-5" id="text-orgc0e61b2">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">INSERT</span> fragment
# <span class="org-comment">--</span>
<span class="org-keyword">INSERT</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org4eefa48" class="outline-5">
<h5 id="org4eefa48">[ii] Insert Into</h5>
<div class="outline-text-5" id="text-org4eefa48">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">INSERT</span> <span class="org-keyword">INTO</span> fragment
# <span class="org-comment">--</span>
<span class="org-keyword">INSERT</span> <span class="org-keyword">INTO</span> $0 ()
<span class="org-keyword">VALUES</span> ()
</pre>
</div>
</div>
</div>

<div id="outline-container-orgff12575" class="outline-5">
<h5 id="orgff12575">[s] Select</h5>
<div class="outline-text-5" id="text-orgff12575">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">SELECT</span> fragment
# <span class="org-comment">--</span>
<span class="org-keyword">SELECT</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc2fad25" class="outline-5">
<h5 id="orgc2fad25">[ssf] Select Star From</h5>
<div class="outline-text-5" id="text-orgc2fad25">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">SELECT</span> * <span class="org-keyword">FROM</span> frag...
# <span class="org-comment">--</span>
<span class="org-keyword">SELECT</span> *
<span class="org-keyword">FROM</span> $0
<span class="org-keyword">WHERE</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1d0ce14" class="outline-5">
<h5 id="org1d0ce14">[sst] Select Top 10</h5>
<div class="outline-text-5" id="text-org1d0ce14">
<p>
Select top 10 rows.
</p>

<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">SELECT</span> <span class="org-keyword">top</span> 10 <span class="org-keyword">rows</span>
# <span class="org-comment">--</span>
<span class="org-keyword">SELECT</span> <span class="org-keyword">TOP</span> 10 *
<span class="org-keyword">FROM</span> $0
</pre>
</div>
</div>
</div>

<div id="outline-container-org7caaa04" class="outline-5">
<h5 id="org7caaa04">[st100] Select Top 100</h5>
<div class="outline-text-5" id="text-org7caaa04">
<p>
Select top 100 rows.
</p>

<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">SELECT</span> <span class="org-keyword">top</span> 100 <span class="org-keyword">rows</span>
# <span class="org-comment">--</span>
<span class="org-keyword">SELECT</span> <span class="org-keyword">TOP</span> 100 *
<span class="org-keyword">FROM</span> $0
</pre>
</div>
</div>
</div>

<div id="outline-container-org6ae407a" class="outline-5">
<h5 id="org6ae407a">[scf] Select Count From</h5>
<div class="outline-text-5" id="text-org6ae407a">
<p>
Count number of records returned by query.
</p>

<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">Count</span> <span class="org-keyword">number</span> <span class="org-keyword">of</span> rec...
# <span class="org-comment">--</span>
<span class="org-keyword">SELECT</span> FORMAT(<span class="org-keyword">COUNT</span>(*), <span class="org-string">'#,##0'</span>)
<span class="org-keyword">FROM</span> $0
</pre>
</div>
</div>
</div>

<div id="outline-container-org60981d2" class="outline-5">
<h5 id="org60981d2">[scgb] Select Count with Group By</h5>
<div class="outline-text-5" id="text-org60981d2">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">Count</span> <span class="org-keyword">with</span> <span class="org-keyword">group</span> <span class="org-keyword">by</span>
# <span class="org-comment">--</span>
<span class="org-keyword">SELECT</span> ${1:col}, <span class="org-keyword">COUNT</span>(*) <span class="org-keyword">FROM</span> $0 <span class="org-keyword">GROUP</span> <span class="org-keyword">BY</span> $1
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfee5d41" class="outline-5">
<h5 id="orgfee5d41">[num] Format Number</h5>
<div class="outline-text-5" id="text-orgfee5d41">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: Format <span class="org-keyword">number</span>
# <span class="org-comment">--</span>
FORMAT($0,<span class="org-string">'#,##0'</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgced202d" class="outline-5">
<h5 id="orgced202d">[smf] Select Sum From</h5>
<div class="outline-text-5" id="text-orgced202d">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">SELECT</span> <span class="org-keyword">SUM</span>(*) <span class="org-keyword">FROM</span>...
# <span class="org-comment">--</span>
<span class="org-keyword">SELECT</span> <span class="org-keyword">SUM</span>($0)
<span class="org-keyword">FROM</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgef9bbe1" class="outline-5">
<h5 id="orgef9bbe1">[f] From</h5>
<div class="outline-text-5" id="text-orgef9bbe1">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">FROM</span> fragment
# <span class="org-comment">--</span>
<span class="org-keyword">FROM</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd614ca1" class="outline-5">
<h5 id="orgd614ca1">[is] INFORMATION_SCHEMA</h5>
<div class="outline-text-5" id="text-orgd614ca1">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: INFORMATION_SCH...
# <span class="org-comment">--</span>
INFORMATION_SCHEMA$0
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb5c4dc6" class="outline-5">
<h5 id="orgb5c4dc6">[w] Where</h5>
<div class="outline-text-5" id="text-orgb5c4dc6">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">WHERE</span> fragment
# <span class="org-comment">--</span>
<span class="org-keyword">WHERE</span> $0
</pre>
</div>
</div>
</div>

<div id="outline-container-orge24eefc" class="outline-5">
<h5 id="orge24eefc">[lk] Like</h5>
<div class="outline-text-5" id="text-orge24eefc">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">LIKE</span> fragment
# <span class="org-comment">--</span>
<span class="org-keyword">LIKE</span> <span class="org-string">'%$0%'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org0c1e6d5" class="outline-5">
<h5 id="org0c1e6d5">[today] Today</h5>
<div class="outline-text-5" id="text-org0c1e6d5">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: Today fragment
# <span class="org-comment">--</span>
<span class="org-builtin">CAST</span>(<span class="org-builtin">GETDATE</span>() <span class="org-keyword">AS</span> <span class="org-type">DATE</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgef59224" class="outline-5">
<h5 id="orgef59224">[now] Now</h5>
<div class="outline-text-5" id="text-orgef59224">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: Now fragment
# <span class="org-comment">--</span>
`(format-<span class="org-type">time</span>-string "<span class="org-string">'%Y-%m-%d %H:%M:%S.%3N'</span>")`
</pre>
</div>
</div>
</div>

<div id="outline-container-org1c0d3d5" class="outline-5">
<h5 id="org1c0d3d5">[gb] Group By</h5>
<div class="outline-text-5" id="text-org1c0d3d5">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">GROUP</span> <span class="org-keyword">BY</span> fragment
# <span class="org-comment">--</span>
<span class="org-keyword">GROUP</span> <span class="org-keyword">BY</span> $0
</pre>
</div>
</div>
</div>

<div id="outline-container-org03df092" class="outline-5">
<h5 id="org03df092">[ha] Having</h5>
<div class="outline-text-5" id="text-org03df092">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">HAVING</span> fragment
# <span class="org-comment">--</span>
<span class="org-keyword">HAVING</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8226681" class="outline-5">
<h5 id="org8226681">[ob] Order By</h5>
<div class="outline-text-5" id="text-org8226681">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">ORDER</span> <span class="org-keyword">BY</span> fragment
# <span class="org-comment">--</span>
<span class="org-keyword">ORDER</span> <span class="org-keyword">BY</span> $0
</pre>
</div>
</div>
</div>

<div id="outline-container-orge4fafaf" class="outline-5">
<h5 id="orge4fafaf">[rwn] Row Number</h5>
<div class="outline-text-5" id="text-orge4fafaf">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: ROW_NUMBER fragment
# <span class="org-comment">--</span>
ROW_NUMBER() <span class="org-keyword">OVER</span>(PARTITION <span class="org-keyword">BY</span>  <span class="org-keyword">ORDER</span> <span class="org-keyword">BY</span> )
</pre>
</div>
</div>
</div>

<div id="outline-container-org99883d4" class="outline-5">
<h5 id="org99883d4">[up] Update</h5>
<div class="outline-text-5" id="text-org99883d4">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">UPDATE</span> fragment
# <span class="org-comment">--</span>
<span class="org-keyword">UPDATE</span> $0
</pre>
</div>
</div>
</div>

<div id="outline-container-orgef858bb" class="outline-5">
<h5 id="orgef858bb">[upd] Update</h5>
<div class="outline-text-5" id="text-orgef858bb">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">UPDATE</span> fragment
# <span class="org-comment">--</span>
<span class="org-keyword">UPDATE</span> $0
<span class="org-keyword">SET</span>
<span class="org-keyword">WHERE</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6c99b52" class="outline-5">
<h5 id="org6c99b52">[d] Delete</h5>
<div class="outline-text-5" id="text-org6c99b52">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">DELETE</span> frag...
