README.org
**** [df] Delete From

Delete statement.

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/df.yasnippet
# name: DELETE FROM frag...
# --
DELETE FROM ${1:[schema].[table_name]}
WHERE $0
#+end_src

**** [tt] Truncate Table

Truncate statement.

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/tt.yasnippet
# name: TRUNCATE fragment
# --
TRUNCATE TABLE $0
#+end_src

**** [lin]

to split up code

**** [linn]

as above, with space for commentary

**** [header]

as above, with even  more space

**** [deci] Declare Int

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/deci.yasnippet
# name: DECLARE int fragment
# --
DECLARE @$0 int
#+end_src

**** [decv] Declare Varchar

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/decv.yasnippet
# name: DECLARE varchar fragment
# --
DECLARE @$0 varchar(256)
#+end_src

**** [be] Begin...End

Insert ~BEGIN...END~ block.

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/be.yasnippet
# name: BEGIN...END block
# --
BEGIN
    $0
END
#+end_src

**** [tc] Try ... Catch

Insert ~TRY...CATCH~ block.

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/tc.yasnippet
# name: TRY ... CATCH fragm...
# --
BEGIN TRY
    $0
END TRY
BEGIN CATCH
    /*
        SELECT
            ERROR_NUMBER() AS ErrorNumber,
            ERROR_SEVERITY() AS ErrorSeverity,
            ERROR_STATE() AS ErrorState,
            ERROR_PROCEDURE() AS ErrorProcedure,
            ERROR_LINE() AS ErrorLine,
            ERROR_MESSAGE() AS ErrorMessage
    */
END CATCH;
#+end_src

**** [ifs] If

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/ifs.yasnippet
# name: IF fragment
# --
IF 1 = 1
BEGIN
    $0
END
#+end_src

**** [ex] Exists

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/ex.yasnippet
# name: EXISTS fragment
# --
EXISTS
#+end_src

**** [nex] Not Exists

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/nex.yasnippet
# name: NOT EXISTS fragment
# --
NOT EXISTS
#+end_src

**** If Exists

Perform an operation if a selected object exists.

#+begin_src sql :tangle no
# name: ...
# --
IF EXISTS(
 SELECT
 FROM ${1:object})
 BEGIN
    $0
 END
#+end_src

**** Case

#+begin_src sql :tangle no
CASE /*expression*/
    WHEN /*expression*/ THEN /*result_expression*/
    WHEN /*expression*/ THEN /*result_expression*/
    ELSE /*result_expression*/
END
#+end_src

**** [cte] Common Table Expression

Temporary inline view.

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/cte.yasnippet
# name: WITH cte fragment
# --
;WITH ${1:cte_name} AS
(
    -- SELECT
    -- FROM
    -- GROUP BY
)
-- Statement that executes the common table expression
SELECT $0
FROM $1;
go
#+end_src

**** [wtf] What The Fuck

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/wtf.yasnippet
# name: WTF fragment
# --
WTF???!??!  AAAAAARRRRRRRRRRGGGGGGGGHHHHHHHHHHHHHHHHHHH!!!!!!!!!!!!!!!!!!
#+end_src

*** Function

Naming convention: functions are prefixed with ~ufn~.

**** [ctif] Create Inline Table Function

Creates an inline table function.

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/citf.yasnippet
# name: Create inline table-va...
# --
IF OBJECT_ID (N'${1:[schema].[inline_function_name]}', N'IF') IS NOT NULL
    DROP FUNCTION $1;
go

-- ================================================
SET ANSI_NULLS ON
go
SET QUOTED_IDENTIFIER ON
go
-- =============================================
-- Author:      /* Author */
-- Create date: /* Create Date */
-- Description: /* Description */
-- =============================================
CREATE FUNCTION $1 (@${2:parameter_name} ${3:parameter_data_type})
RETURNS TABLE
--WITH ENCRYPTION|SCHEMABINDING, ...
AS
RETURN
(
    -- Add the SELECT statement with parameter references here
    SELECT @$2 AS c1
    $0
);
go

-- =============================================
-- Example to execute function
-- =============================================
SELECT *
FROM $1 /* owner.inline_function_name */
    (/* value_for_@parameter_name */)
go
#+end_src

