README.html
# <span class="org-comment">--</span>
<span class="org-keyword">DELETE</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5c7289f" class="outline-5">
<h5 id="org5c7289f">[df] Delete From</h5>
<div class="outline-text-5" id="text-org5c7289f">
<p>
Delete statement.
</p>

<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">DELETE</span> <span class="org-keyword">FROM</span> frag...
# <span class="org-comment">--</span>
<span class="org-keyword">DELETE</span> <span class="org-keyword">FROM</span> ${1:[<span class="org-keyword">schema</span>].[<span class="org-keyword">table_name</span>]}
<span class="org-keyword">WHERE</span> $0
</pre>
</div>
</div>
</div>

<div id="outline-container-orgccd0d55" class="outline-5">
<h5 id="orgccd0d55">[tt] Truncate Table</h5>
<div class="outline-text-5" id="text-orgccd0d55">
<p>
Truncate statement.
</p>

<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">TRUNCATE</span> fragment
# <span class="org-comment">--</span>
<span class="org-keyword">TRUNCATE</span> <span class="org-keyword">TABLE</span> $0
</pre>
</div>
</div>
</div>

<div id="outline-container-org03af6b2" class="outline-5">
<h5 id="org03af6b2">[lin]</h5>
<div class="outline-text-5" id="text-org03af6b2">
<p>
to split up code
</p>
</div>
</div>

<div id="outline-container-org707e40a" class="outline-5">
<h5 id="org707e40a">[linn]</h5>
<div class="outline-text-5" id="text-org707e40a">
<p>
as above, with space for commentary
</p>
</div>
</div>

<div id="outline-container-orge1ea3a2" class="outline-5">
<h5 id="orge1ea3a2">[header]</h5>
<div class="outline-text-5" id="text-orge1ea3a2">
<p>
as above, with even  more space
</p>
</div>
</div>

<div id="outline-container-org6a66037" class="outline-5">
<h5 id="org6a66037">[deci] Declare Int</h5>
<div class="outline-text-5" id="text-org6a66037">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">DECLARE</span> <span class="org-type">int</span> fragment
# <span class="org-comment">--</span>
<span class="org-keyword">DECLARE</span> <span class="org-variable-name">@</span>$0 <span class="org-type">int</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org2422906" class="outline-5">
<h5 id="org2422906">[decv] Declare Varchar</h5>
<div class="outline-text-5" id="text-org2422906">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">DECLARE</span> <span class="org-type">varchar</span> fragment
# <span class="org-comment">--</span>
<span class="org-keyword">DECLARE</span> <span class="org-variable-name">@</span>$0 <span class="org-type">varchar</span>(256)
</pre>
</div>
</div>
</div>

<div id="outline-container-org11e149a" class="outline-5">
<h5 id="org11e149a">[be] Begin&#x2026;End</h5>
<div class="outline-text-5" id="text-org11e149a">
<p>
Insert <code>BEGIN...END</code> block.
</p>

<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">BEGIN</span>...<span class="org-keyword">END</span> block
# <span class="org-comment">--</span>
<span class="org-keyword">BEGIN</span>
    $0
<span class="org-keyword">END</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org565f9bf" class="outline-5">
<h5 id="org565f9bf">[tc] Try &#x2026; Catch</h5>
<div class="outline-text-5" id="text-org565f9bf">
<p>
Insert <code>TRY...CATCH</code> block.
</p>

<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: TRY ... CATCH fragm...
# <span class="org-comment">--</span>
<span class="org-keyword">BEGIN</span> TRY
    $0
<span class="org-keyword">END</span> TRY
<span class="org-keyword">BEGIN</span> CATCH
    <span class="org-comment-delimiter">/*</span>
<span class="org-comment">        SELECT</span>
<span class="org-comment">            ERROR_NUMBER() AS ErrorNumber,</span>
<span class="org-comment">            ERROR_SEVERITY() AS ErrorSeverity,</span>
<span class="org-comment">            ERROR_STATE() AS ErrorState,</span>
<span class="org-comment">            ERROR_PROCEDURE() AS ErrorProcedure,</span>
<span class="org-comment">            ERROR_LINE() AS ErrorLine,</span>
<span class="org-comment">            ERROR_MESSAGE() AS ErrorMessage</span>
<span class="org-comment">    */</span>
<span class="org-keyword">END</span> CATCH;
</pre>
</div>
</div>
</div>

<div id="outline-container-org14753be" class="outline-5">
<h5 id="org14753be">[ifs] If</h5>
<div class="outline-text-5" id="text-org14753be">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">IF</span> fragment
# <span class="org-comment">--</span>
<span class="org-keyword">IF</span> 1 = 1
<span class="org-keyword">BEGIN</span>
    $0
<span class="org-keyword">END</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org82efaba" class="outline-5">
<h5 id="org82efaba">[ex] Exists</h5>
<div class="outline-text-5" id="text-org82efaba">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">EXISTS</span> fragment
# <span class="org-comment">--</span>
<span class="org-keyword">EXISTS</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org93181f5" class="outline-5">
<h5 id="org93181f5">[nex] Not Exists</h5>
<div class="outline-text-5" id="text-org93181f5">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">NOT</span> <span class="org-keyword">EXISTS</span> fragment
# <span class="org-comment">--</span>
<span class="org-keyword">NOT</span> <span class="org-keyword">EXISTS</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org2ecc99c" class="outline-5">
<h5 id="org2ecc99c">If Exists</h5>
<div class="outline-text-5" id="text-org2ecc99c">
<p>
Perform an operation if a selected object exists.
</p>

<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: ...
# <span class="org-comment">--</span>
<span class="org-keyword">IF</span> <span class="org-keyword">EXISTS</span>(
 <span class="org-keyword">SELECT</span>
 <span class="org-keyword">FROM</span> ${1:<span class="org-type">object</span>})
 <span class="org-keyword">BEGIN</span>
    $0
 <span class="org-keyword">END</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org83a36bf" class="outline-5">
<h5 id="org83a36bf">Case</h5>
<div class="outline-text-5" id="text-org83a36bf">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">CASE</span> <span class="org-comment-delimiter">/*</span><span class="org-comment">expression*/</span>
    <span class="org-keyword">WHEN</span> <span class="org-comment-delimiter">/*</span><span class="org-comment">expression*/</span> <span class="org-keyword">THEN</span> <span class="org-comment-delimiter">/*</span><span class="org-comment">result_expression*/</span>
    <span class="org-keyword">WHEN</span> <span class="org-comment-delimiter">/*</span><span class="org-comment">expression*/</span> <span class="org-keyword">THEN</span> <span class="org-comment-delimiter">/*</span><span class="org-comment">result_expression*/</span>
    <span class="org-keyword">ELSE</span> <span class="org-comment-delimiter">/*</span><span class="org-comment">result_expression*/</span>
<span class="org-keyword">END</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbc14736" class="outline-5">
<h5 id="orgbc14736">[cte] Common Table Expression</h5>
<div class="outline-text-5" id="text-orgbc14736">
<p>
Temporary inline view.
</p>

<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">WITH</span> cte fragment
# <span class="org-comment">--</span>
;<span class="org-keyword">WITH</span> ${1:cte_name} <span class="org-keyword">AS</span>
(
    <span class="org-comment">-- SELECT</span>
    <span class="org-comment">-- FROM</span>
    <span class="org-comment">-- GROUP BY</span>
)
<span class="org-comment">-- Statement that executes the common table expression</span>
<span class="org-keyword">SELECT</span> $0
<span class="org-keyword">FROM</span> $1;
<span class="org-doc">go</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7029926" class="outline-5">
<h5 id="org7029926">[wtf] What The Fuck</h5>
<div class="outline-text-5" id="text-org7029926">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: WTF fragment
# <span class="org-comment">--</span>
WTF???!??!  AAAAAARRRRRRRRRRGGGGGGGGHHHHHHHHHHHHHHHHHHH!!!!!!!!!!!!!!!!!!
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org0222e26" class="outline-4">
<h4 id="org0222e26">Function</h4>
<div class="outline-text-4" id="text-org0222e26">
<p>
Naming convention: functions are prefixed with <code>ufn</code>.
</p>
</div>

<div id="outline-container-org9043fef" class="outline-5">
<h5 id="org9043fef">[ctif] Create Inline Table Function</h5>
<div class="outline-text-5" id="text-org9043fef">
<p>
Creates an inline table function.
</p>

<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">Create</span> inline <span class="org-keyword">table</span>-va...
# <span class="org-comment">--</span>
<span class="org-keyword">IF</span> <span class="org-builtin">OBJECT_ID</span> (N<span class="org-string">'${1:[schema].[inline_function_name]}'</span>, N<span class="org-string">'IF'</span>) <span class="org-keyword">IS</span> <span class="org-keyword">NOT</span> <span class="org-keyword">NULL</span>
    <span class="org-keyword">DROP</span> <span class="org-keyword">FUNCTION</span> $1;
<span class="org-doc">go</span>

<span class="org-comment">-- ================================================</span>
<span class="org-doc">SET ANSI_NULLS ON</span>
<span class="org-doc">go</span>
<span class="org-doc">SET QUOTED_IDENTIFIER ON</span>
<span class="org-doc">go</span>
<span class="org-comment">-- =============================================</span>
<span class="org-comment">-- Author:      /* Author */</span>
<span class="org-comment">-- Create date: /* Create Date */</span>
<span class="org-comment">-- Description: /* Description */</span>
<span class="org-comment">-- =============================================</span>
<span class="org-keyword">CREATE</span> <span class="org-keyword">FUNCTION</span> $1 (<span class="org-variable-name">@</span>${2:<span class="org-keyword">parameter_name</span>} ${3:parameter_data_type})
<span class="org-keyword">RETURNS</span> <span class="org-keyword">TABLE</span>
<span class="org-comment">--WITH ENCRYPTION|SCHEMABINDING, ...</span>
<span class="org-keyword">AS</span>
<span class="org-keyword">RETURN</span>
(
    <span class="org-comment">-- Add the SELECT statement with parameter references here</span>
    <span class="org-keyword">SELECT</span> <span class="org-variable-name">@</span>$2 <span class="org-keyword">AS</span> c1
    $0
);
<span class="org-doc">go</span>

<span class="org-comment">-- =============================================</span>
<span class="org-comment">-- Example to execute function</span>
<span class="org-comment">-- =============================================</span>
<span class="org-keyword">SELECT</span> *
<span class="org-keyword">FROM</span> $1 <span class="org-comment-delimiter">/* </span><span class="org-comment">owner.inline_function_name */</span>
    (<span class="org-comment-delimiter">/* </span><span class="org-comment">value_for_@parameter_name */</span>)
<span class="org-doc">go</span>
</pre>
</div>
</div>
</div>
