README.org
**** [ctf] Create Multi-Statement Table Function

Creates a multi-statement table function.

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/ctf.yasnippet
# name: Create multi-stateme...
# --
IF OBJECT_ID (N'${1:[schema].[table_function_name]}', N'TF') IS NOT NULL
    DROP FUNCTION $1;
go

CREATE FUNCTION $1 (@{2:parameter_name} ${3:parameter_data_type})
RETURNS @${4:return_variable_name} TABLE
(
    /* table type definition */
    $2 $3
)
--WITH ENCRYPTION|SCHEMABINDING, ...
AS
BEGIN
    /* function body */
    INSERT @$4
    SELECT 1
    RETURN
END;
go

-- =============================================
-- Example to execute function
-- =============================================
SELECT * FROM $1 /* owner.table_function_name */
    (/* value_for_@parameter_name */)
go
#+end_src

**** [csf] Create Scalar Function

Creates a scalar function.

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/csf.yasnippet
# name: Create scalar function
# --
IF OBJECT_ID (N'${1:[schema].[scalar_function_name]}', N'FN') IS NOT NULL
    DROP FUNCTION $1;
go

-- =============================================
SET ANSI_NULLS ON
go
SET QUOTED_IDENTIFIER ON
go
-- =============================================
-- Author:      /* Author */
-- Create date: /* Create Date */
-- Description: /* Description */
-- =============================================
CREATE FUNCTION $1 (@{2:parameter_name} ${3:parameter_data_type})
RETURNS ${4:function_data_type}
--WITH ENCRYPTION|SCHEMABINDING, ...
AS
-- Returns ...
BEGIN
    /* function body */
--  eg.
--  DECLARE @v_ret $4
--  SELECT @v_ret = /* scalar expression */
--  RETURN @v_ret$0
END;
go

-- =============================================
-- Example to execute function
-- =============================================
SELECT $1 /* owner.scalar_function_name */
    (/* value_for_@parameter_name */)
go
#+end_src

**** [af] Alter Function

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/af.yasnippet
# name: ALTER FUNCTION fr...
# --
ALTER FUNCTION $0
#+end_src

**** [dfn] Drop Function

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/dfn.yasnippet
# name: Drop function
# --
DROP FUNCTION $0
#+end_src

*** Help

**** [d] Describe object

List or describe database objects. Calls ~sp_help~.

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/d.yasnippet
# name: Describe object
# --
EXEC sp_help '${1:object}';
#+end_src

**** [ld] List Databases

List databases.

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/ld.yasnippet
# name: List Databases
# --
SELECT
    name,
    create_date,
    compatibility_level,
    collation_name
FROM sys.databases
WHERE name LIKE '%%';
#+end_src

A *collation* consists of an enumeration of data and their equivalence to deduce
therefrom the processing behavior of the strings especially in the *comparison*
and *sorting* operations.

- *Code Page --* 1-4 digit number specifying code page.
- *Case Sensitivity --* CS = case sensitive, CI = insensitive.
- *Accent Sensitivity --* AI = accent insensitive, AS = accent sensitive.

Collation ~SQL_Latin1_General_CP1_CI_AI~:

- CP1 = Code Page 1252, that is Latin(ANSI).
- Case-Insensitive.
- Accent-Insensitive.

**** [lf] List Functions

List functions.

**** [li] List Indexes

List indexes.

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/li.yasnippet
# name: List Indexes
# --
SELECT
    t.name                              AS "TableName",
    i.name                              AS "IndexName",
    col.name                            AS "ColumnName",
    i.index_id                          AS "IndexId",
    ic.index_column_id                  AS "ColumnId"
FROM sys.indexes                        i
INNER JOIN sys.index_columns            ic
    ON i.object_id = ic.object_id AND i.index_id = ic.index_id
INNER JOIN sys.columns                  col
    ON ic.object_id = col.object_id AND ic.column_id = col.column_id
INNER JOIN sys.tables                   t
    ON i.object_id = t.object_id
WHERE i.is_primary_key = 0
    AND i.is_unique = 0
    AND i.is_unique_constraint = 0
    AND t.is_ms_shipped = 0
    AND i.name LIKE '%%'                -- Index name.
ORDER BY
    t.name,
    i.name,
    i.index_id,
    ic.index_column_id;
#+end_src

A *comma-separated list* of index columns could be an improvement...

