README.html

<div id="outline-container-org8f32f0c" class="outline-5">
<h5 id="org8f32f0c">[ctf] Create Multi-Statement Table Function</h5>
<div class="outline-text-5" id="text-org8f32f0c">
<p>
Creates a multi-statement table function.
</p>

<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">Create</span> multi-stateme...
# <span class="org-comment">--</span>
<span class="org-keyword">IF</span> <span class="org-builtin">OBJECT_ID</span> (N<span class="org-string">'${1:[schema].[table_function_name]}'</span>, N<span class="org-string">'TF'</span>) <span class="org-keyword">IS</span> <span class="org-keyword">NOT</span> <span class="org-keyword">NULL</span>
    <span class="org-keyword">DROP</span> <span class="org-keyword">FUNCTION</span> $1;
<span class="org-doc">go</span>

<span class="org-keyword">CREATE</span> <span class="org-keyword">FUNCTION</span> $1 (<span class="org-variable-name">@</span>{2:<span class="org-keyword">parameter_name</span>} ${3:parameter_data_type})
<span class="org-keyword">RETURNS</span> <span class="org-variable-name">@</span>${4:return_variable_name} <span class="org-keyword">TABLE</span>
(
    <span class="org-comment-delimiter">/* </span><span class="org-comment">table type definition */</span>
    $2 $3
)
<span class="org-comment">--WITH ENCRYPTION|SCHEMABINDING, ...</span>
<span class="org-keyword">AS</span>
<span class="org-keyword">BEGIN</span>
    <span class="org-comment-delimiter">/* </span><span class="org-comment">function body */</span>
    <span class="org-keyword">INSERT</span> <span class="org-variable-name">@</span>$4
    <span class="org-keyword">SELECT</span> 1
    <span class="org-keyword">RETURN</span>
<span class="org-keyword">END</span>;
<span class="org-doc">go</span>

<span class="org-comment">-- =============================================</span>
<span class="org-comment">-- Example to execute function</span>
<span class="org-comment">-- =============================================</span>
<span class="org-keyword">SELECT</span> * <span class="org-keyword">FROM</span> $1 <span class="org-comment-delimiter">/* </span><span class="org-comment">owner.table_function_name */</span>
    (<span class="org-comment-delimiter">/* </span><span class="org-comment">value_for_@parameter_name */</span>)
<span class="org-doc">go</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org571752a" class="outline-5">
<h5 id="org571752a">[csf] Create Scalar Function</h5>
<div class="outline-text-5" id="text-org571752a">
<p>
Creates a scalar function.
</p>

<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">Create</span> scalar <span class="org-keyword">function</span>
# <span class="org-comment">--</span>
<span class="org-keyword">IF</span> <span class="org-builtin">OBJECT_ID</span> (N<span class="org-string">'${1:[schema].[scalar_function_name]}'</span>, N<span class="org-string">'FN'</span>) <span class="org-keyword">IS</span> <span class="org-keyword">NOT</span> <span class="org-keyword">NULL</span>
    <span class="org-keyword">DROP</span> <span class="org-keyword">FUNCTION</span> $1;
<span class="org-doc">go</span>

<span class="org-comment">-- =============================================</span>
<span class="org-doc">SET ANSI_NULLS ON</span>
<span class="org-doc">go</span>
<span class="org-doc">SET QUOTED_IDENTIFIER ON</span>
<span class="org-doc">go</span>
<span class="org-comment">-- =============================================</span>
<span class="org-comment">-- Author:      /* Author */</span>
<span class="org-comment">-- Create date: /* Create Date */</span>
<span class="org-comment">-- Description: /* Description */</span>
<span class="org-comment">-- =============================================</span>
<span class="org-keyword">CREATE</span> <span class="org-keyword">FUNCTION</span> $1 (<span class="org-variable-name">@</span>{2:<span class="org-keyword">parameter_name</span>} ${3:parameter_data_type})
<span class="org-keyword">RETURNS</span> ${4:function_data_type}
<span class="org-comment">--WITH ENCRYPTION|SCHEMABINDING, ...</span>
<span class="org-keyword">AS</span>
<span class="org-comment">-- Returns ...</span>
<span class="org-keyword">BEGIN</span>
    <span class="org-comment-delimiter">/* </span><span class="org-comment">function body */</span>
<span class="org-comment">--  eg.</span>
<span class="org-comment">--  DECLARE @v_ret $4</span>
<span class="org-comment">--  SELECT @v_ret = /* scalar expression */</span>
<span class="org-comment">--  RETURN @v_ret$0</span>
<span class="org-keyword">END</span>;
<span class="org-doc">go</span>

<span class="org-comment">-- =============================================</span>
<span class="org-comment">-- Example to execute function</span>
<span class="org-comment">-- =============================================</span>
<span class="org-keyword">SELECT</span> $1 <span class="org-comment-delimiter">/* </span><span class="org-comment">owner.scalar_function_name */</span>
    (<span class="org-comment-delimiter">/* </span><span class="org-comment">value_for_@parameter_name */</span>)
<span class="org-doc">go</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb036702" class="outline-5">
<h5 id="orgb036702">[af] Alter Function</h5>
<div class="outline-text-5" id="text-orgb036702">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">ALTER</span> <span class="org-keyword">FUNCTION</span> fr...
# <span class="org-comment">--</span>
<span class="org-keyword">ALTER</span> <span class="org-keyword">FUNCTION</span> $0
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc548cac" class="outline-5">
<h5 id="orgc548cac">[dfn] Drop Function</h5>
<div class="outline-text-5" id="text-orgc548cac">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">Drop</span> <span class="org-keyword">function</span>
# <span class="org-comment">--</span>
<span class="org-keyword">DROP</span> <span class="org-keyword">FUNCTION</span> $0
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orge7a2ebe" class="outline-4">
<h4 id="orge7a2ebe">Help</h4>
<div class="outline-text-4" id="text-orge7a2ebe">
</div>
<div id="outline-container-org41ff146" class="outline-5">
<h5 id="org41ff146">[d] Describe object</h5>
<div class="outline-text-5" id="text-org41ff146">
<p>
List or describe database objects. Calls <code>sp_help</code>.
</p>

<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">Describe</span> <span class="org-type">object</span>
# <span class="org-comment">--</span>
<span class="org-keyword">EXEC</span> sp_help <span class="org-string">'${1:object}'</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-org5f2156e" class="outline-5">
<h5 id="org5f2156e">[ld] List Databases</h5>
<div class="outline-text-5" id="text-org5f2156e">
<p>
List databases.
</p>

<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: List Databases
# <span class="org-comment">--</span>
<span class="org-keyword">SELECT</span>
    <span class="org-keyword">name</span>,
    create_date,
    compatibility_level,
    <span class="org-keyword">collation_name</span>
<span class="org-keyword">FROM</span> sys.databases
<span class="org-keyword">WHERE</span> <span class="org-keyword">name</span> <span class="org-keyword">LIKE</span> <span class="org-string">'%%'</span>;
</pre>
</div>

<p>
A <b>collation</b> consists of an enumeration of data and their equivalence to deduce
therefrom the processing behavior of the strings especially in the <b>comparison</b>
and <b>sorting</b> operations.
</p>

<ul class="org-ul">
<li><b>Code Page --</b> 1-4 digit number specifying code page.</li>
<li><b>Case Sensitivity --</b> CS = case sensitive, CI = insensitive.</li>
<li><b>Accent Sensitivity --</b> AI = accent insensitive, AS = accent sensitive.</li>
</ul>

<p>
Collation <code>SQL_Latin1_General_CP1_CI_AI</code>:
</p>

<ul class="org-ul">
<li>CP1 = Code Page 1252, that is Latin(ANSI).</li>
<li>Case-Insensitive.</li>
<li>Accent-Insensitive.</li>
</ul>
</div>
</div>

<div id="outline-container-orgbe6a0be" class="outline-5">
<h5 id="orgbe6a0be">[lf] List Functions</h5>
<div class="outline-text-5" id="text-orgbe6a0be">
<p>
List functions.
</p>
</div>
</div>

<div id="outline-container-orgee21faf" class="outline-5">
<h5 id="orgee21faf">[li] List Indexes</h5>
<div class="outline-text-5" id="text-orgee21faf">
<p>
List indexes.
</p>

<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: List Indexes
# <span class="org-comment">--</span>
<span class="org-keyword">SELECT</span>
    t.<span class="org-keyword">name</span>                              <span class="org-keyword">AS</span> "TableName",
    i.<span class="org-keyword">name</span>                              <span class="org-keyword">AS</span> "IndexName",
    col.<span class="org-keyword">name</span>                            <span class="org-keyword">AS</span> "ColumnName",
    i.index_id                          <span class="org-keyword">AS</span> "IndexId",
    ic.index_column_id                  <span class="org-keyword">AS</span> "ColumnId"
<span class="org-keyword">FROM</span> sys.indexes                        i
<span class="org-keyword">INNER</span> <span class="org-keyword">JOIN</span> sys.index_columns            ic
    <span class="org-keyword">ON</span> i.<span class="org-builtin">object_id</span> = ic.<span class="org-builtin">object_id</span> <span class="org-keyword">AND</span> i.index_id = ic.index_id
<span class="org-keyword">INNER</span> <span class="org-keyword">JOIN</span> sys.columns                  col
    <span class="org-keyword">ON</span> ic.<span class="org-builtin">object_id</span> = col.<span class="org-builtin">object_id</span> <span class="org-keyword">AND</span> ic.column_id = col.column_id
<span class="org-keyword">INNER</span> <span class="org-keyword">JOIN</span> sys.tables                   t
    <span class="org-keyword">ON</span> i.<span class="org-builtin">object_id</span> = t.<span class="org-builtin">object_id</span>
<span class="org-keyword">WHERE</span> i.is_primary_key = 0
    <span class="org-keyword">AND</span> i.is_unique = 0
    <span class="org-keyword">AND</span> i.is_unique_constraint = 0
    <span class="org-keyword">AND</span> t.is_ms_shipped = 0
    <span class="org-keyword">AND</span> i.<span class="org-keyword">name</span> <span class="org-keyword">LIKE</span> <span class="org-string">'%%'</span>                <span class="org-comment">-- Index name.</span>
<span class="org-keyword">ORDER</span> <span class="org-keyword">BY</span>
    t.<span class="org-keyword">name</span>,
    i.<span class="org-keyword">name</span>,
    i.index_id,
    ic.index_column_id;
</pre>
</div>

<p>
A <b>comma-separated list</b> of index columns could be an improvement&#x2026;
</p>
</div>

<ul class="org-ul">
