README.org
***** List unused indexes

#+begin_src sql :tangle no
USE MASTER;
GO
GRANT VIEW SERVER STATE TO afm;
#+end_src

#+begin_src sql :tangle no
SELECT
    OBJECT_NAME(s.object_id)            AS "table_name",
    i.name                              AS "index_name",
    i.index_id,
    user_seeks + user_scans + user_lookups AS "reads",
    user_updates                        AS "writes",
    SUM(p.rows)                         AS "rows",
    last_user_update
FROM sys.dm_db_index_usage_stats        s
JOIN sys.indexes                        i
    ON s.object_id = i.object_id AND i.index_id = s.index_id
JOIN sys.partitions                     p
    ON s.object_id = p.object_id AND p.index_id = s.index_id
WHERE OBJECTPROPERTY(s.object_id, 'IsUserTable') = 1
    AND s.index_id > 0
    AND s.database_id = DB_ID() -- Database ID of the current database.
    AND user_seeks + user_scans + user_lookups = 0
GROUP BY
    OBJECT_NAME(s.object_id),
    i.name,
    i.index_id,
    user_seeks + user_scans + user_lookups,
    user_updates,
    last_user_update
ORDER BY
    writes DESC,
    reads ASC;
#+end_src

If you see indexes where:

- there are no seeks, scans or lookups, but
- there are updates,

this means that SQL Server has not used the index to satisfy a query but still
needs to maintain the index.

#+begin_tip
Remember that the data from these DMVs is reset when SQL Server is restarted, so
make sure you have collected data for a long enough period of time to determine
which indexes may be good candidates to be dropped.
#+end_tip

**** [ll] List Logins

List logins and associated roles.

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/ll.yasnippet
# name: List Logins
# --
SELECT
    name,
    type_desc,
    default_database_name,
    type,
    create_date
FROM sys.server_principals
WHERE type_desc = 'SQL_LOGIN'
    AND name LIKE '%%'
ORDER BY name;
#+end_src

**** [ls] List Schemas

List schemas.

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/ls.yasnippet
# name: List Schemas
# --
SELECT
    name,
    schema_id,
    principal_id
FROM sys.schemas
WHERE name LIKE '%%'
#+end_src

**** [lt] List Tables

List tables.

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/lt.yasnippet
# name: List Tables
# --
SELECT
    TABLE_CATALOG,
    TABLE_SCHEMA,
    TABLE_NAME,
    TABLE_TYPE
FROM INFORMATION_SCHEMA.TABLES
WHERE TABLE_TYPE = 'BASE TABLE'
    AND TABLE_NAME LIKE '%%';
#+end_src

**** [lv] List Views

List views.

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/lv.yasnippet
# name: List Views
# --
SELECT
    table_catalog AS catalog,
    TABLE_SCHEMA AS schema_name,
    TABLE_NAME AS view_name
FROM INFORMATION_SCHEMA.VIEWS
WHERE TABLE_NAME LIKE '%%';
#+end_src

**** [sf] Show Function

Show a function's definition.

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/sf.yasnippet
# name: Show Function
# --
SELECT OBJECT_DEFINITION(OBJECT_ID('${1:funcname}'));
#+end_src

