README.html
<li><a id="orgdcf04b4"></a>List unused indexes<br />
<div class="outline-text-6" id="text-orgdcf04b4">
<div class="org-src-container">
<pre class="src src-sql"><span class="org-doc">USE MASTER;</span>
<span class="org-doc">GO</span>
<span class="org-keyword">GRANT</span> <span class="org-keyword">VIEW</span> SERVER <span class="org-keyword">STATE</span> <span class="org-keyword">TO</span> afm;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">SELECT</span>
    <span class="org-builtin">OBJECT_NAME</span>(s.<span class="org-builtin">object_id</span>)            <span class="org-keyword">AS</span> "<span class="org-keyword">table_name</span>",
    i.<span class="org-keyword">name</span>                              <span class="org-keyword">AS</span> "index_name",
    i.index_id,
    user_seeks + user_scans + user_lookups <span class="org-keyword">AS</span> "<span class="org-keyword">reads</span>",
    user_updates                        <span class="org-keyword">AS</span> "writes",
    <span class="org-keyword">SUM</span>(p.<span class="org-keyword">rows</span>)                         <span class="org-keyword">AS</span> "<span class="org-keyword">rows</span>",
    last_user_update
<span class="org-keyword">FROM</span> sys.dm_db_index_usage_stats        s
<span class="org-keyword">JOIN</span> sys.indexes                        i
    <span class="org-keyword">ON</span> s.<span class="org-builtin">object_id</span> = i.<span class="org-builtin">object_id</span> <span class="org-keyword">AND</span> i.index_id = s.index_id
<span class="org-keyword">JOIN</span> sys.partitions                     p
    <span class="org-keyword">ON</span> s.<span class="org-builtin">object_id</span> = p.<span class="org-builtin">object_id</span> <span class="org-keyword">AND</span> p.index_id = s.index_id
<span class="org-keyword">WHERE</span> <span class="org-builtin">OBJECTPROPERTY</span>(s.<span class="org-builtin">object_id</span>, <span class="org-string">'IsUserTable'</span>) = 1
    <span class="org-keyword">AND</span> s.index_id &gt; 0
    <span class="org-keyword">AND</span> s.database_id = <span class="org-builtin">DB_ID</span>() <span class="org-comment">-- Database ID of the current database.</span>
    <span class="org-keyword">AND</span> user_seeks + user_scans + user_lookups = 0
<span class="org-keyword">GROUP</span> <span class="org-keyword">BY</span>
    <span class="org-builtin">OBJECT_NAME</span>(s.<span class="org-builtin">object_id</span>),
    i.<span class="org-keyword">name</span>,
    i.index_id,
    user_seeks + user_scans + user_lookups,
    user_updates,
    last_user_update
<span class="org-keyword">ORDER</span> <span class="org-keyword">BY</span>
    writes <span class="org-keyword">DESC</span>,
    <span class="org-keyword">reads</span> <span class="org-keyword">ASC</span>;
</pre>
</div>

<p>
If you see indexes where:
</p>

<ul class="org-ul">
<li>there are no seeks, scans or lookups, but</li>
<li>there are updates,</li>
</ul>

<p>
this means that SQL Server has not used the index to satisfy a query but still
needs to maintain the index.
</p>

<div class="tip">
<p>
Remember that the data from these DMVs is reset when SQL Server is restarted, so
make sure you have collected data for a long enough period of time to determine
which indexes may be good candidates to be dropped.
</p>

</div>
</div>
</li>
</ul>
</div>

<div id="outline-container-org1496481" class="outline-5">
<h5 id="org1496481">[ll] List Logins</h5>
<div class="outline-text-5" id="text-org1496481">
<p>
List logins and associated roles.
</p>

<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: List Logins
# <span class="org-comment">--</span>
<span class="org-keyword">SELECT</span>
    <span class="org-keyword">name</span>,
    type_desc,
    default_database_name,
    <span class="org-keyword">type</span>,
    create_date
<span class="org-keyword">FROM</span> sys.server_principals
<span class="org-keyword">WHERE</span> type_desc = <span class="org-string">'SQL_LOGIN'</span>
    <span class="org-keyword">AND</span> <span class="org-keyword">name</span> <span class="org-keyword">LIKE</span> <span class="org-string">'%%'</span>
<span class="org-keyword">ORDER</span> <span class="org-keyword">BY</span> <span class="org-keyword">name</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-org5e1db2e" class="outline-5">
<h5 id="org5e1db2e">[ls] List Schemas</h5>
<div class="outline-text-5" id="text-org5e1db2e">
<p>
List schemas.
</p>

<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: List Schemas
# <span class="org-comment">--</span>
<span class="org-keyword">SELECT</span>
    <span class="org-keyword">name</span>,
    schema_id,
    principal_id
<span class="org-keyword">FROM</span> sys.schemas
<span class="org-keyword">WHERE</span> <span class="org-keyword">name</span> <span class="org-keyword">LIKE</span> <span class="org-string">'%%'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org0a12269" class="outline-5">
<h5 id="org0a12269">[lt] List Tables</h5>
<div class="outline-text-5" id="text-org0a12269">
<p>
List tables.
</p>

<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: List Tables
# <span class="org-comment">--</span>
<span class="org-keyword">SELECT</span>
    TABLE_CATALOG,
    TABLE_SCHEMA,
    <span class="org-keyword">TABLE_NAME</span>,
    TABLE_TYPE
<span class="org-keyword">FROM</span> INFORMATION_SCHEMA.TABLES
<span class="org-keyword">WHERE</span> TABLE_TYPE = <span class="org-string">'BASE TABLE'</span>
    <span class="org-keyword">AND</span> <span class="org-keyword">TABLE_NAME</span> <span class="org-keyword">LIKE</span> <span class="org-string">'%%'</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-org39c8a67" class="outline-5">
<h5 id="org39c8a67">[lv] List Views</h5>
<div class="outline-text-5" id="text-org39c8a67">
<p>
List views.
</p>

<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: List Views
# <span class="org-comment">--</span>
<span class="org-keyword">SELECT</span>
    table_catalog <span class="org-keyword">AS</span> <span class="org-keyword">catalog</span>,
    TABLE_SCHEMA <span class="org-keyword">AS</span> <span class="org-keyword">schema_name</span>,
    <span class="org-keyword">TABLE_NAME</span> <span class="org-keyword">AS</span> view_name
<span class="org-keyword">FROM</span> INFORMATION_SCHEMA.VIEWS
<span class="org-keyword">WHERE</span> <span class="org-keyword">TABLE_NAME</span> <span class="org-keyword">LIKE</span> <span class="org-string">'%%'</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-org979cc67" class="outline-5">
<h5 id="org979cc67">[sf] Show Function</h5>
<div class="outline-text-5" id="text-org979cc67">
<p>
Show a function&rsquo;s definition.
</p>

<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: Show <span class="org-keyword">Function</span>
# <span class="org-comment">--</span>
<span class="org-keyword">SELECT</span> OBJECT_DEFINITION(<span class="org-builtin">OBJECT_ID</span>(<span class="org-string">'${1:funcname}'</span>));
</pre>
</div>
</div>
</div>
