README.org
**** [sis] Search In Sources

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/sis.yasnippet
# name: Search In Sources
# --
/*
This is an easy way to look through the sources of all objects in the database
if you need to find particular string. This script can be used, for example,
to find references of some specific object by other objects. Depending on the
size of your database you might want to limit the search scope to particular
object type. Just comment unneeded object types in WHERE statement.
Enter search string between %% marks in @SearchPattern initialisation statement.
When you get the results you can copy object name from "FullName" column and
use SSMSBoost to quickly locate it in the object explorer, or you can continue
searching in results using "Find in ResultsGrid" function.

This script is provided to you by SSMSBoost as is. Improvements and comments are welcome.
Redistribution with reference to SSMSBoost project website is welcome.
SSMSBoost team, 2014
*/
DECLARE @SearchPattern NVARCHAR(128)

SET @SearchPattern = '%$0%'

SELECT
    SCHEMA_NAME(o.schema_id) AS [schema],
    o.[name],
    o.[type],
    '['+SCHEMA_NAME(o.schema_id)+'].['+o.[name]+']' AS [FullName],
    OBJECT_DEFINITION(object_id) AS [Source]
FROM sys.objects AS o
WHERE LOWER(OBJECT_DEFINITION(o.object_id)) LIKE LOWER(@SearchPattern)
    AND o.[type] IN (
    'C', --- = Check constraint
    'D', --- = Default (constraint or stand-alone)
    'P', --- = SQL stored procedure
    'FN', --- = SQL scalar function
    'R', --- = Rule
    'RF', --- = Replication filter procedure
    'TR', --- = SQL trigger (schema-scoped DML trigger, or DDL trigger at either the database or server scope)
    'IF', --- = SQL inline table-valued function
    'TF', --- = SQL table-valued function
    'V') --- = View
UNION ALL
SELECT
    SCHEMA_NAME(q.schema_id) AS [schema],
    q.[name],
    'SQ' AS [type],
    '['+SCHEMA_NAME(q.schema_id)+'].['+q.[name]+']' AS [FullName],
    activation_procedure AS [Source]
FROM sys.service_queues q
WHERE q.activation_procedure LIKE LOWER(@SearchPattern)
ORDER BY
    o.[type],
    o.[name];
#+end_src

*** Index

**** [crunq] Create Unique Index

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/crunq.yasnippet
# name: Create unique index
# --
CREATE UNIQUE INDEX unq_$0
ON
#+end_src

**** [cni] Create Non-Clustered Index (crnci)

Creates a basic, non-clustered index.

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/cni.yasnippet
# name: Create non-unique n...
# --
IF EXISTS (SELECT name FROM sys.indexes WHERE name = N'nci_${3:index_name}')
    DROP INDEX nci_$3 ON ${1:[schema].[owner_name]};
go

CREATE NONCLUSTERED INDEX nci_$3
ON $1 (${2:column})
--WITH PAD_INDEX
--    | FILLFACTOR = fillfactor
--    | IGNORE_DUP_KEY
--    | DROP_EXISTING
--    | STATISTICS_NORECOMPUTE
--    | SORT_IN_TEMPDB, .. as required
-- ON filegroup
go
$0
#+end_src

**** [cuni] Create Unique Non-Clustered Index

Creates a unique, non-clustered index.

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/cuni.yasnippet
# name: Create unique nonclu...
# --
IF EXISTS (SELECT name FROM sys.indexes WHERE name = N'unq_${3:index_name}')
    DROP INDEX unq_$3 ON ${1:[schema].[owner_name]};
go

CREATE UNIQUE NONCLUSTERED INDEX unq_$3
ON $1 (${2:column})
--WITH
--    PAD_INDEX,
--    FILLFACTOR = fillfactor,
--    IGNORE_DUP_KEY,
--    DROP_EXISTING = OFF,
--    STATISTICS_NORECOMPUTE,
--    SORT_IN_TEMPDB = OFF, .. as required
ON ${4:filegroup_name}
go
$0
#+end_src

**** [cci] Create Clustered Index (crci)

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/cci.yasnippet
# name: Create non-unique cl...
# --
IF EXISTS (SELECT name FROM sys.indexes WHERE name = N'ci_${3:index_name}')
    DROP INDEX ci_$3 ON ${1:[schema].[owner_name]};
go

CREATE CLUSTERED INDEX ci_$3
ON $1 (${2:column})
--WITH PAD_INDEX
--    | FILLFACTOR = fillfactor
--    | IGNORE_DUP_KEY
--    | DROP_EXISTING
--    | STATISTICS_NORECOMPUTE
--    | SORT_IN_TEMPDB, .. as required
-- ON filegroup
go
$0
#+end_src

