README.html

<div id="outline-container-orgf4e9eb8" class="outline-5">
<h5 id="orgf4e9eb8">[sis] Search In Sources</h5>
<div class="outline-text-5" id="text-orgf4e9eb8">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">Search</span> <span class="org-keyword">In</span> Sources
# <span class="org-comment">--</span>
<span class="org-comment-delimiter">/*</span>
<span class="org-comment">This is an easy way to look through the sources of all objects in the database</span>
<span class="org-comment">if you need to find particular string. This script can be used, for example,</span>
<span class="org-comment">to find references of some specific object by other objects. Depending on the</span>
<span class="org-comment">size of your database you might want to limit the search scope to particular</span>
<span class="org-comment">object type. Just comment unneeded object types in WHERE statement.</span>
<span class="org-comment">Enter search string between %% marks in @SearchPattern initialisation statement.</span>
<span class="org-comment">When you get the results you can copy object name from "FullName" column and</span>
<span class="org-comment">use SSMSBoost to quickly locate it in the object explorer, or you can continue</span>
<span class="org-comment">searching in results using "Find in ResultsGrid" function.</span>

<span class="org-comment">This script is provided to you by SSMSBoost as is. Improvements and comments are welcome.</span>
<span class="org-comment">Redistribution with reference to SSMSBoost project website is welcome.</span>
<span class="org-comment">SSMSBoost team, 2014</span>
<span class="org-comment">*/</span>
<span class="org-keyword">DECLARE</span> <span class="org-variable-name">@SearchPattern</span> <span class="org-type">NVARCHAR</span>(128)

<span class="org-keyword">SET</span> <span class="org-variable-name">@SearchPattern</span> = <span class="org-string">'%$0%'</span>

<span class="org-keyword">SELECT</span>
    <span class="org-keyword">SCHEMA_NAME</span>(o.schema_id) <span class="org-keyword">AS</span> [<span class="org-keyword">schema</span>],
    o.[<span class="org-keyword">name</span>],
    o.[<span class="org-keyword">type</span>],
    <span class="org-string">'['</span>+<span class="org-keyword">SCHEMA_NAME</span>(o.schema_id)+<span class="org-string">'].['</span>+o.[<span class="org-keyword">name</span>]+<span class="org-string">']'</span> <span class="org-keyword">AS</span> [FullName],
    OBJECT_DEFINITION(<span class="org-builtin">object_id</span>) <span class="org-keyword">AS</span> [<span class="org-keyword">Source</span>]
<span class="org-keyword">FROM</span> sys.objects <span class="org-keyword">AS</span> o
<span class="org-keyword">WHERE</span> <span class="org-builtin">LOWER</span>(OBJECT_DEFINITION(o.<span class="org-builtin">object_id</span>)) <span class="org-keyword">LIKE</span> <span class="org-builtin">LOWER</span>(<span class="org-variable-name">@SearchPattern</span>)
    <span class="org-keyword">AND</span> o.[<span class="org-keyword">type</span>] <span class="org-keyword">IN</span> (
    <span class="org-string">'C'</span>, <span class="org-comment">--- = Check constraint</span>
    <span class="org-string">'D'</span>, <span class="org-comment">--- = Default (constraint or stand-alone)</span>
    <span class="org-string">'P'</span>, <span class="org-comment">--- = SQL stored procedure</span>
    <span class="org-string">'FN'</span>, <span class="org-comment">--- = SQL scalar function</span>
    <span class="org-string">'R'</span>, <span class="org-comment">--- = Rule</span>
    <span class="org-string">'RF'</span>, <span class="org-comment">--- = Replication filter procedure</span>
    <span class="org-string">'TR'</span>, <span class="org-comment">--- = SQL trigger (schema-scoped DML trigger, or DDL trigger at either the database or server scope)</span>
    <span class="org-string">'IF'</span>, <span class="org-comment">--- = SQL inline table-valued function</span>
    <span class="org-string">'TF'</span>, <span class="org-comment">--- = SQL table-valued function</span>
    <span class="org-string">'V'</span>) <span class="org-comment">--- = View</span>
<span class="org-keyword">UNION</span> <span class="org-keyword">ALL</span>
<span class="org-keyword">SELECT</span>
    <span class="org-keyword">SCHEMA_NAME</span>(q.schema_id) <span class="org-keyword">AS</span> [<span class="org-keyword">schema</span>],
    q.[<span class="org-keyword">name</span>],
    <span class="org-string">'SQ'</span> <span class="org-keyword">AS</span> [<span class="org-keyword">type</span>],
    <span class="org-string">'['</span>+<span class="org-keyword">SCHEMA_NAME</span>(q.schema_id)+<span class="org-string">'].['</span>+q.[<span class="org-keyword">name</span>]+<span class="org-string">']'</span> <span class="org-keyword">AS</span> [FullName],
    activation_procedure <span class="org-keyword">AS</span> [<span class="org-keyword">Source</span>]
<span class="org-keyword">FROM</span> sys.service_queues q
<span class="org-keyword">WHERE</span> q.activation_procedure <span class="org-keyword">LIKE</span> <span class="org-builtin">LOWER</span>(<span class="org-variable-name">@SearchPattern</span>)
<span class="org-keyword">ORDER</span> <span class="org-keyword">BY</span>
    o.[<span class="org-keyword">type</span>],
    o.[<span class="org-keyword">name</span>];
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga57cddb" class="outline-4">
<h4 id="orga57cddb">Index</h4>
<div class="outline-text-4" id="text-orga57cddb">
</div>
<div id="outline-container-org5120ecc" class="outline-5">
<h5 id="org5120ecc">[crunq] Create Unique Index</h5>
<div class="outline-text-5" id="text-org5120ecc">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">Create</span> <span class="org-keyword">unique</span> <span class="org-keyword">index</span>
# <span class="org-comment">--</span>
<span class="org-keyword">CREATE</span> <span class="org-keyword">UNIQUE</span> <span class="org-keyword">INDEX</span> unq_$0
<span class="org-keyword">ON</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd41f463" class="outline-5">
<h5 id="orgd41f463">[cni] Create Non-Clustered Index (crnci)</h5>
<div class="outline-text-5" id="text-orgd41f463">
<p>
Creates a basic, non-clustered index.
</p>

<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">Create</span> non-<span class="org-keyword">unique</span> n...
# <span class="org-comment">--</span>
<span class="org-keyword">IF</span> <span class="org-keyword">EXISTS</span> (<span class="org-keyword">SELECT</span> <span class="org-keyword">name</span> <span class="org-keyword">FROM</span> sys.indexes <span class="org-keyword">WHERE</span> <span class="org-keyword">name</span> = N<span class="org-string">'nci_${3:index_name}'</span>)
    <span class="org-keyword">DROP</span> <span class="org-keyword">INDEX</span> nci_$3 <span class="org-keyword">ON</span> ${1:[<span class="org-keyword">schema</span>].[owner_name]};
<span class="org-doc">go</span>

<span class="org-keyword">CREATE</span> <span class="org-keyword">NONCLUSTERED</span> <span class="org-keyword">INDEX</span> nci_$3
<span class="org-keyword">ON</span> $1 (${2:<span class="org-keyword">column</span>})
<span class="org-comment">--WITH PAD_INDEX</span>
<span class="org-comment">--    | FILLFACTOR = fillfactor</span>
<span class="org-comment">--    | IGNORE_DUP_KEY</span>
<span class="org-comment">--    | DROP_EXISTING</span>
<span class="org-comment">--    | STATISTICS_NORECOMPUTE</span>
<span class="org-comment">--    | SORT_IN_TEMPDB, .. as required</span>
<span class="org-comment">-- ON filegroup</span>
<span class="org-doc">go</span>
$0
</pre>
</div>
</div>
</div>

<div id="outline-container-orgeee6f6c" class="outline-5">
<h5 id="orgeee6f6c">[cuni] Create Unique Non-Clustered Index</h5>
<div class="outline-text-5" id="text-orgeee6f6c">
<p>
Creates a unique, non-clustered index.
</p>

<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">Create</span> <span class="org-keyword">unique</span> nonclu...
# <span class="org-comment">--</span>
<span class="org-keyword">IF</span> <span class="org-keyword">EXISTS</span> (<span class="org-keyword">SELECT</span> <span class="org-keyword">name</span> <span class="org-keyword">FROM</span> sys.indexes <span class="org-keyword">WHERE</span> <span class="org-keyword">name</span> = N<span class="org-string">'unq_${3:index_name}'</span>)
    <span class="org-keyword">DROP</span> <span class="org-keyword">INDEX</span> unq_$3 <span class="org-keyword">ON</span> ${1:[<span class="org-keyword">schema</span>].[owner_name]};
<span class="org-doc">go</span>

<span class="org-keyword">CREATE</span> <span class="org-keyword">UNIQUE</span> <span class="org-keyword">NONCLUSTERED</span> <span class="org-keyword">INDEX</span> unq_$3
<span class="org-keyword">ON</span> $1 (${2:<span class="org-keyword">column</span>})
<span class="org-comment">--WITH</span>
<span class="org-comment">--    PAD_INDEX,</span>
<span class="org-comment">--    FILLFACTOR = fillfactor,</span>
<span class="org-comment">--    IGNORE_DUP_KEY,</span>
<span class="org-comment">--    DROP_EXISTING = OFF,</span>
<span class="org-comment">--    STATISTICS_NORECOMPUTE,</span>
<span class="org-comment">--    SORT_IN_TEMPDB = OFF, .. as required</span>
<span class="org-keyword">ON</span> ${4:<span class="org-builtin">filegroup_name</span>}
<span class="org-doc">go</span>
$0
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc2ae849" class="outline-5">
<h5 id="orgc2ae849">[cci] Create Clustered Index (crci)</h5>
<div class="outline-text-5" id="text-orgc2ae849">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">Create</span> non-<span class="org-keyword">unique</span> cl...
# <span class="org-comment">--</span>
<span class="org-keyword">IF</span> <span class="org-keyword">EXISTS</span> (<span class="org-keyword">SELECT</span> <span class="org-keyword">name</span> <span class="org-keyword">FROM</span> sys.indexes <span class="org-keyword">WHERE</span> <span class="org-keyword">name</span> = N<span class="org-string">'ci_${3:index_name}'</span>)
    <span class="org-keyword">DROP</span> <span class="org-keyword">INDEX</span> ci_$3 <span class="org-keyword">ON</span> ${1:[<span class="org-keyword">schema</span>].[owner_name]};
<span class="org-doc">go</span>

<span class="org-keyword">CREATE</span> <span class="org-keyword">CLUSTERED</span> <span class="org-keyword">INDEX</span> ci_$3
<span class="org-keyword">ON</span> $1 (${2:<span class="org-keyword">column</span>})
<span class="org-comment">--WITH PAD_INDEX</span>
<span class="org-comment">--    | FILLFACTOR = fillfactor</span>
<span class="org-comment">--    | IGNORE_DUP_KEY</span>
<span class="org-comment">--    | DROP_EXISTING</span>
<span class="org-comment">--    | STATISTICS_NORECOMPUTE</span>
<span class="org-comment">--    | SORT_IN_TEMPDB, .. as required</span>
<span class="org-comment">-- ON filegroup</span>
<span class="org-doc">go</span>
$0
</pre>
</div>
</div>
</div>
