README.org
**** [cuci] Create Unique Clustered Index

Create index full syntax.

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/cuci.yasnippet
# name: Create unique cluster...
# --
IF EXISTS (SELECT name FROM sys.indexes WHERE name = N'unq_${3:index_name}')
    DROP INDEX unq_$3 ON ${1:[schema].[owner_name]};
go

CREATE UNIQUE CLUSTERED INDEX unq_$3
ON $1 (${2:column})
WITH
PAD_INDEX,
FILLFACTOR = ${5:fillfactor_value},
IGNORE_DUP_KEY,
DROP_EXISTING,
STATISTICS_NORECOMPUTE
--    | SORT_IN_TEMPDB, .. as required
ON ${4:filegroup_name}
go
$0
#+end_src

**** [di] Drop Index

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/di.yasnippet
# name: Drop index
# --
DROP INDEX $0
#+end_src

*** Join fragment

**** [j] Join

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/j.yasnippet
# name: JOIN fragment
# --
JOIN $0
#+end_src

**** [cj] Cross Join

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/cj.yasnippet
# name: CROSS JOIN fragment
# --
CROSS JOIN $0
#+end_src

**** [fj] Full Join

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/fj.yasnippet
# name: FULL JOIN fragment
# --
FULL JOIN $0
#+end_src

**** [foj] Full Outer Join

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/foj.yasnippet
# name: FULL OUTER JOIN fr...
# --
FULL OUTER JOIN $0
#+end_src

**** [ij] Inner Join

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/ij.yasnippet
# name: INNER JOIN fragment
# --
INNER JOIN $0
#+end_src

**** [j] Join

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/j.yasnippet
# name: JOIN fragment
# --
JOIN $0
#+end_src

**** [lj] Left Join

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/lj.yasnippet
# name: LEFT JOIN fragment
# --
LEFT JOIN $0
#+end_src

**** [loj] Left Outer Join

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/loj.yasnippet
# name: LEFT OUTER JOIN fr...
# --
LEFT OUTER JOIN $0
#+end_src

**** [rj] Right Join

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/rj.yasnippet
# name: RIGHT JOIN fragment
# --
RIGHT JOIN $0
#+end_src

**** [roj] Right Outer Join

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/roj.yasnippet
# name: RIGHT OUTER JOIN f...
# --
RIGHT OUTER JOIN $0
#+end_src

*** Login

**** [cl] Create SQL Authentication Login

Creates a SQL Server Authentication login.

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/cl.yasnippet
# name: CREATE SQL Server l...
# --
CREATE LOGIN ${1:SQL_login_name}
WITH PASSWORD = N'${2:Strong_P@ssword}'$0 /* HASHED */ /* MUST_CHANGE */
--  DEFAULT_DATABASE = database
--  DEFAULT_LANGUAGE = language
--  CHECK_POLICY = ON | OFF
--  SID = sid
--  CHECK_EXPIRATION = ON | OFF
--  CREDENTIAL = credential_name
go
#+end_src

**** Create Windows Authentication Login

Creates a Windows Authentication login.

#+begin_src sql :tangle no
# name: CREATE Windows l...
# --
CREATE LOGIN ${1:[domain_name\user_name]}
FROM WINDOWS$0
WITH
DEFAULT_DATABASE = ${2:default_database}
--  DEFAULT_LANGUAGE = language
--  CERTIFICATE certificate_name
--  ASYMMETRIC KEY key_name
go
#+end_src

**** [dl] Drop Login

Drop login.

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/dl.yasnippet
# name: Drop login
# --
DROP LOGIN ${1:SQL_login_name}
go
#+end_src

*** Role

**** Create Role

Create Database Role.

#+begin_src sql :tangle no
USE ${1:database_name}
go

CREATE ROLE ${2:role_name}$0
go
#+end_src

*** Schema

**** Create Schema

Create a database schema.

#+begin_src sql :tangle no
CREATE SCHEMA ${1:schema}$0
#+end_src

*** Set options

**** [san] Set ANSI_NULLS

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/san.yasnippet
# name: Change the current A...
# --
SET ANSI_NULLS ON$0
#+end_src

**** [sqi] Set QUOTED_IDENTIFIER

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/sqi.yasnippet
# name: Change the current ...
# --
SET QUOTED_IDENTIFIER ON$0
#+end_src

