README.html

<div id="outline-container-org0dd9a47" class="outline-5">
<h5 id="org0dd9a47">[cuci] Create Unique Clustered Index</h5>
<div class="outline-text-5" id="text-org0dd9a47">
<p>
Create index full syntax.
</p>

<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">Create</span> <span class="org-keyword">unique</span> cluster...
# <span class="org-comment">--</span>
<span class="org-keyword">IF</span> <span class="org-keyword">EXISTS</span> (<span class="org-keyword">SELECT</span> <span class="org-keyword">name</span> <span class="org-keyword">FROM</span> sys.indexes <span class="org-keyword">WHERE</span> <span class="org-keyword">name</span> = N<span class="org-string">'unq_${3:index_name}'</span>)
    <span class="org-keyword">DROP</span> <span class="org-keyword">INDEX</span> unq_$3 <span class="org-keyword">ON</span> ${1:[<span class="org-keyword">schema</span>].[owner_name]};
<span class="org-doc">go</span>

<span class="org-keyword">CREATE</span> <span class="org-keyword">UNIQUE</span> <span class="org-keyword">CLUSTERED</span> <span class="org-keyword">INDEX</span> unq_$3
<span class="org-keyword">ON</span> $1 (${2:<span class="org-keyword">column</span>})
<span class="org-keyword">WITH</span>
PAD_INDEX,
<span class="org-keyword">FILLFACTOR</span> = ${5:fillfactor_value},
IGNORE_DUP_KEY,
DROP_EXISTING,
STATISTICS_NORECOMPUTE
<span class="org-comment">--    | SORT_IN_TEMPDB, .. as required</span>
<span class="org-keyword">ON</span> ${4:<span class="org-builtin">filegroup_name</span>}
<span class="org-doc">go</span>
$0
</pre>
</div>
</div>
</div>

<div id="outline-container-org3265746" class="outline-5">
<h5 id="org3265746">[di] Drop Index</h5>
<div class="outline-text-5" id="text-org3265746">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">Drop</span> <span class="org-keyword">index</span>
# <span class="org-comment">--</span>
<span class="org-keyword">DROP</span> <span class="org-keyword">INDEX</span> $0
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org7bfe62f" class="outline-4">
<h4 id="org7bfe62f">Join fragment</h4>
<div class="outline-text-4" id="text-org7bfe62f">
</div>
<div id="outline-container-org40ab7bc" class="outline-5">
<h5 id="org40ab7bc">[j] Join</h5>
<div class="outline-text-5" id="text-org40ab7bc">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">JOIN</span> fragment
# <span class="org-comment">--</span>
<span class="org-keyword">JOIN</span> $0
</pre>
</div>
</div>
</div>

<div id="outline-container-org1b1119b" class="outline-5">
<h5 id="org1b1119b">[cj] Cross Join</h5>
<div class="outline-text-5" id="text-org1b1119b">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">CROSS</span> <span class="org-keyword">JOIN</span> fragment
# <span class="org-comment">--</span>
<span class="org-keyword">CROSS</span> <span class="org-keyword">JOIN</span> $0
</pre>
</div>
</div>
</div>

<div id="outline-container-org47cf34b" class="outline-5">
<h5 id="org47cf34b">[fj] Full Join</h5>
<div class="outline-text-5" id="text-org47cf34b">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">FULL</span> <span class="org-keyword">JOIN</span> fragment
# <span class="org-comment">--</span>
<span class="org-keyword">FULL</span> <span class="org-keyword">JOIN</span> $0
</pre>
</div>
</div>
</div>

<div id="outline-container-org9dcf8cb" class="outline-5">
<h5 id="org9dcf8cb">[foj] Full Outer Join</h5>
<div class="outline-text-5" id="text-org9dcf8cb">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">FULL</span> <span class="org-keyword">OUTER</span> <span class="org-keyword">JOIN</span> fr...
# <span class="org-comment">--</span>
<span class="org-keyword">FULL</span> <span class="org-keyword">OUTER</span> <span class="org-keyword">JOIN</span> $0
</pre>
</div>
</div>
</div>

<div id="outline-container-orgddf34b0" class="outline-5">
<h5 id="orgddf34b0">[ij] Inner Join</h5>
<div class="outline-text-5" id="text-orgddf34b0">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">INNER</span> <span class="org-keyword">JOIN</span> fragment
# <span class="org-comment">--</span>
<span class="org-keyword">INNER</span> <span class="org-keyword">JOIN</span> $0
</pre>
</div>
</div>
</div>

<div id="outline-container-org100526a" class="outline-5">
<h5 id="org100526a">[j] Join</h5>
<div class="outline-text-5" id="text-org100526a">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">JOIN</span> fragment
# <span class="org-comment">--</span>
<span class="org-keyword">JOIN</span> $0
</pre>
</div>
</div>
</div>

<div id="outline-container-org541b910" class="outline-5">
<h5 id="org541b910">[lj] Left Join</h5>
<div class="outline-text-5" id="text-org541b910">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">LEFT</span> <span class="org-keyword">JOIN</span> fragment
# <span class="org-comment">--</span>
<span class="org-keyword">LEFT</span> <span class="org-keyword">JOIN</span> $0
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf99c9d0" class="outline-5">
<h5 id="orgf99c9d0">[loj] Left Outer Join</h5>
<div class="outline-text-5" id="text-orgf99c9d0">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">LEFT</span> <span class="org-keyword">OUTER</span> <span class="org-keyword">JOIN</span> fr...
# <span class="org-comment">--</span>
<span class="org-keyword">LEFT</span> <span class="org-keyword">OUTER</span> <span class="org-keyword">JOIN</span> $0
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcdc3021" class="outline-5">
<h5 id="orgcdc3021">[rj] Right Join</h5>
<div class="outline-text-5" id="text-orgcdc3021">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">RIGHT</span> <span class="org-keyword">JOIN</span> fragment
# <span class="org-comment">--</span>
<span class="org-keyword">RIGHT</span> <span class="org-keyword">JOIN</span> $0
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd25a96d" class="outline-5">
<h5 id="orgd25a96d">[roj] Right Outer Join</h5>
<div class="outline-text-5" id="text-orgd25a96d">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">RIGHT</span> <span class="org-keyword">OUTER</span> <span class="org-keyword">JOIN</span> f...
# <span class="org-comment">--</span>
<span class="org-keyword">RIGHT</span> <span class="org-keyword">OUTER</span> <span class="org-keyword">JOIN</span> $0
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org373e108" class="outline-4">
<h4 id="org373e108">Login</h4>
<div class="outline-text-4" id="text-org373e108">
</div>
<div id="outline-container-org6a21cf8" class="outline-5">
<h5 id="org6a21cf8">[cl] Create SQL Authentication Login</h5>
<div class="outline-text-5" id="text-org6a21cf8">
<p>
Creates a SQL Server Authentication login.
</p>

<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">CREATE</span> <span class="org-keyword">SQL</span> Server l...
# <span class="org-comment">--</span>
<span class="org-keyword">CREATE</span> LOGIN ${1:SQL_login_name}
<span class="org-keyword">WITH</span> PASSWORD = N<span class="org-string">'${2:Strong_P@ssword}'</span>$0 <span class="org-comment-delimiter">/* </span><span class="org-comment">HASHED */</span> <span class="org-comment-delimiter">/* </span><span class="org-comment">MUST_CHANGE */</span>
<span class="org-comment">--  DEFAULT_DATABASE = database</span>
<span class="org-comment">--  DEFAULT_LANGUAGE = language</span>
<span class="org-comment">--  CHECK_POLICY = ON | OFF</span>
<span class="org-comment">--  SID = sid</span>
<span class="org-comment">--  CHECK_EXPIRATION = ON | OFF</span>
<span class="org-comment">--  CREDENTIAL = credential_name</span>
<span class="org-doc">go</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5517cdf" class="outline-5">
<h5 id="org5517cdf">Create Windows Authentication Login</h5>
<div class="outline-text-5" id="text-org5517cdf">
<p>
Creates a Windows Authentication login.
</p>

<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">CREATE</span> Windows l...
# <span class="org-comment">--</span>
<span class="org-keyword">CREATE</span> LOGIN ${1:[domain_name\<span class="org-builtin">user_name</span>]}
<span class="org-keyword">FROM</span> WINDOWS$0
<span class="org-keyword">WITH</span>
DEFAULT_DATABASE = ${2:default_database}
<span class="org-comment">--  DEFAULT_LANGUAGE = language</span>
<span class="org-comment">--  CERTIFICATE certificate_name</span>
<span class="org-comment">--  ASYMMETRIC KEY key_name</span>
<span class="org-doc">go</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org06b2083" class="outline-5">
<h5 id="org06b2083">[dl] Drop Login</h5>
<div class="outline-text-5" id="text-org06b2083">
<p>
Drop login.
</p>

<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">Drop</span> login
# <span class="org-comment">--</span>
<span class="org-keyword">DROP</span> LOGIN ${1:SQL_login_name}
<span class="org-doc">go</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org88ba6af" class="outline-4">
<h4 id="org88ba6af">Role</h4>
<div class="outline-text-4" id="text-org88ba6af">
</div>
<div id="outline-container-orgad7eff9" class="outline-5">
<h5 id="orgad7eff9">Create Role</h5>
<div class="outline-text-5" id="text-orgad7eff9">
<p>
Create Database Role.
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-doc">USE ${1:database_name}</span>
<span class="org-doc">go</span>

<span class="org-keyword">CREATE</span> <span class="org-keyword">ROLE</span> ${2:role_name}$0
<span class="org-doc">go</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org95b3c96" class="outline-4">
<h4 id="org95b3c96">Schema</h4>
<div class="outline-text-4" id="text-org95b3c96">
</div>
<div id="outline-container-orga1ced45" class="outline-5">
<h5 id="orga1ced45">Create Schema</h5>
<div class="outline-text-5" id="text-orga1ced45">
<p>
Create a database schema.
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">CREATE</span> <span class="org-keyword">SCHEMA</span> ${1:<span class="org-keyword">schema</span>}$0
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb10fb41" class="outline-4">
<h4 id="orgb10fb41">Set options</h4>
<div class="outline-text-4" id="text-orgb10fb41">
</div>
<div id="outline-container-org076bafc" class="outline-5">
<h5 id="org076bafc">[san] Set ANSI_NULLS</h5>
<div class="outline-text-5" id="text-org076bafc">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: Change the <span class="org-keyword">current</span> A...
# <span class="org-comment">--</span>
<span class="org-doc">SET ANSI_NULLS ON$0</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8f3d074" class="outline-5">
<h5 id="org8f3d074">[sqi] Set QUOTED_IDENTIFIER</h5>
<div class="outline-text-5" id="text-org8f3d074">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: Change the <span class="org-keyword">current</span> ...
# <span class="org-comment">--</span>
<span class="org-doc">SET QUOTED_IDENTIFIER ON$0</span>
</pre>
</div>
</div>
</div>
