README.org
**** [sxa] Set XACT_ABORT

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/sxa.yasnippet
# name: Change the current X...
# --
SET XACT_ABORT OFF$0
#+end_src

*** Stored Procedure

Naming convention: stored procedures are prefixed with ~usp~.

**** [cp] Create Procedure Basic Template

Create a simple stored procedure with output parameter.

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/cp.yasnippet
# name: Create stored proced...
# --
-- Drop stored procedure if it already exists
IF OBJECT_ID ('${1:[schema].[procedure_name]}', 'P') IS NOT NULL
    DROP PROCEDURE $1;
go

-- =============================================
SET ANSI_NULLS ON
go
SET QUOTED_IDENTIFIER ON
go
-- =============================================
-- Author:      /* Author */
-- Create date: /* Create Date */
-- Description: /* Description */
-- =============================================
CREATE PROCEDURE $1
    -- Add the parameters for the function here
    @${2:parameter_name_1} ${3:parameter_data_type_1} = ${4:default_value_for_parameter_1}
    @${5:parameter_name_2} ${6:parameter_data_type_2} OUTPUT
-- WITH ENCRYPTION, RECOMPILE, EXECUTE AS CALLER|SELF|OWNER| 'user_name'
AS
BEGIN
    -- SET NOCOUNT ON added to prevent extra result sets from
    -- interfering with SELECT statements.
    SET NOCOUNT ON;

    -- Insert statements for procedure here
    SELECT @$2$0
END
go

--SET QUOTED_IDENTIFIER ON|OFF
--SET ANSI_NULLS ON|OFF
--go

-- =============================================
-- Example to execute the stored procedure
-- =============================================
DECLARE @${7:variable_for_output_parameter} $6

EXECUTE $1 /* value_for_parameter_1 */, $7 OUTPUT

SELECT $7
go
#+end_src

**** [crlp] Create CLR Procedure

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/clrp.yasnippet
# name: Create CLR stored pr...
# --
--SET QUOTED_IDENTIFIER ON|OFF
--SET ANSI_NULLS ON|OFF
--go

CREATE PROCEDURE ${1:[schema].[procedure_name]}
(
    @${2:parameter_name} ${3:parameter_data_type}
)
-- WITH EXECUTE AS CALLER|SELF|OWNER| 'user_name'
AS EXTERNAL NAME ${4:[assembly].[class].[method]};
go

--SET QUOTED_IDENTIFIER ON|OFF
--SET ANSI_NULLS ON|OFF
--go$0
#+end_src

**** [ap] Alter Procedure

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/ap.yasnippet
# name: ALTER PROCEDURE
# --
ALTER PROCEDURE $0
#+end_src

**** [dp] Drop Procedure

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/dp.yasnippet
# name: Drop stored procedure
# --
DROP PROCEDURE $0
#+end_src

*** Synonym

**** Create Synonym

Creates a synonym.

#+begin_src sql :tangle no
CREATE SYNONYM ${1:[schema].[synonym_name]}
FOR ${2:[schema].[object_name]};
go$0
#+end_src

*** Table

**** [ct] Create Table (crt)

Creates a table (and drop previous one with the same name).

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/ct.yasnippet
# name: Create table
# --
IF OBJECT_ID ('${1:[schema].[table_name]}', 'U') IS NOT NULL
    DROP TABLE $1;
go

CREATE TABLE $1
(
    ${2:column_1} ${3:data_type_1} ${4:column_nullability_1},
    ${5:column_2} ${6:data_type_2} ${5:column_nullability_2},$0
    CONSTRAINT /* contraint_name */ PRIMARY KEY (/* columns_in_primary_key */)
);
go
#+end_src

**** [ctt] Create Temporary Table (crtt)

Creates a temporary table.

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/ctt.yasnippet
# name: Create temp table
# --
CREATE TABLE #temp
(
    $0
);
go
#+end_src

**** [ctv] Create Table Variable (crtv)

Creates a table variable.

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/ctv.yasnippet
# name: Create table var
# --
DECLARE @tbl TABLE
(
    $0
)
#+end_src

**** [at] Alter Table fragment

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/at.yasnippet
# name: ALTER TABLE fragm...
# --
ALTER TABLE $0
#+end_src

**** [ata] Add Column

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/ata.yasnippet
# name: Add column
# --
-- Add a new column to the table.
ALTER TABLE ${1:[schema].[table_name]}
    ADD [${2:new_column_name}] ${3:data_type} ${4:new_column_nullability};
go$0
#+end_src

