README.html

<div id="outline-container-orgb16815a" class="outline-5">
<h5 id="orgb16815a">[sxa] Set XACT_ABORT</h5>
<div class="outline-text-5" id="text-orgb16815a">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: Change the <span class="org-keyword">current</span> X...
# <span class="org-comment">--</span>
<span class="org-doc">SET XACT_ABORT OFF$0</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org1087bf2" class="outline-4">
<h4 id="org1087bf2">Stored Procedure</h4>
<div class="outline-text-4" id="text-org1087bf2">
<p>
Naming convention: stored procedures are prefixed with <code>usp</code>.
</p>
</div>

<div id="outline-container-org53532ce" class="outline-5">
<h5 id="org53532ce">[cp] Create Procedure Basic Template</h5>
<div class="outline-text-5" id="text-org53532ce">
<p>
Create a simple stored procedure with output parameter.
</p>

<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">Create</span> stored proced...
# <span class="org-comment">--</span>
<span class="org-comment">-- Drop stored procedure if it already exists</span>
<span class="org-keyword">IF</span> <span class="org-builtin">OBJECT_ID</span> (<span class="org-string">'${1:[schema].[procedure_name]}'</span>, <span class="org-string">'P'</span>) <span class="org-keyword">IS</span> <span class="org-keyword">NOT</span> <span class="org-keyword">NULL</span>
    <span class="org-keyword">DROP</span> <span class="org-keyword">PROCEDURE</span> $1;
<span class="org-doc">go</span>

<span class="org-comment">-- =============================================</span>
<span class="org-doc">SET ANSI_NULLS ON</span>
<span class="org-doc">go</span>
<span class="org-doc">SET QUOTED_IDENTIFIER ON</span>
<span class="org-doc">go</span>
<span class="org-comment">-- =============================================</span>
<span class="org-comment">-- Author:      /* Author */</span>
<span class="org-comment">-- Create date: /* Create Date */</span>
<span class="org-comment">-- Description: /* Description */</span>
<span class="org-comment">-- =============================================</span>
<span class="org-keyword">CREATE</span> <span class="org-keyword">PROCEDURE</span> $1
    <span class="org-comment">-- Add the parameters for the function here</span>
    <span class="org-variable-name">@</span>${2:parameter_name_1} ${3:parameter_data_type_1} = ${4:default_value_for_parameter_1}
    <span class="org-variable-name">@</span>${5:parameter_name_2} ${6:parameter_data_type_2} <span class="org-keyword">OUTPUT</span>
<span class="org-comment">-- WITH ENCRYPTION, RECOMPILE, EXECUTE AS CALLER|SELF|OWNER| 'user_name'</span>
<span class="org-keyword">AS</span>
<span class="org-keyword">BEGIN</span>
    <span class="org-comment">-- SET NOCOUNT ON added to prevent extra result sets from</span>
    <span class="org-comment">-- interfering with SELECT statements.</span>
    <span class="org-keyword">SET</span> NOCOUNT <span class="org-keyword">ON</span>;

    <span class="org-comment">-- Insert statements for procedure here</span>
    <span class="org-keyword">SELECT</span> <span class="org-variable-name">@</span>$2$0
<span class="org-keyword">END</span>
<span class="org-doc">go</span>

<span class="org-comment">--SET QUOTED_IDENTIFIER ON|OFF</span>
<span class="org-comment">--SET ANSI_NULLS ON|OFF</span>
<span class="org-comment">--go</span>

<span class="org-comment">-- =============================================</span>
<span class="org-comment">-- Example to execute the stored procedure</span>
<span class="org-comment">-- =============================================</span>
<span class="org-keyword">DECLARE</span> <span class="org-variable-name">@</span>${7:variable_for_output_parameter} $6

<span class="org-keyword">EXECUTE</span> $1 <span class="org-comment-delimiter">/* </span><span class="org-comment">value_for_parameter_1 */</span>, $7 <span class="org-keyword">OUTPUT</span>

<span class="org-keyword">SELECT</span> $7
<span class="org-doc">go</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org55a81a7" class="outline-5">
<h5 id="org55a81a7">[crlp] Create CLR Procedure</h5>
<div class="outline-text-5" id="text-org55a81a7">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">Create</span> CLR stored pr...
# <span class="org-comment">--</span>
<span class="org-comment">--SET QUOTED_IDENTIFIER ON|OFF</span>
<span class="org-comment">--SET ANSI_NULLS ON|OFF</span>
<span class="org-comment">--go</span>

<span class="org-keyword">CREATE</span> <span class="org-keyword">PROCEDURE</span> ${1:[<span class="org-keyword">schema</span>].[procedure_name]}
(
    <span class="org-variable-name">@</span>${2:<span class="org-keyword">parameter_name</span>} ${3:parameter_data_type}
)
<span class="org-comment">-- WITH EXECUTE AS CALLER|SELF|OWNER| 'user_name'</span>
<span class="org-keyword">AS</span> <span class="org-keyword">EXTERNAL</span> <span class="org-keyword">NAME</span> ${4:[assembly].[<span class="org-keyword">class</span>].[<span class="org-keyword">method</span>]};
<span class="org-doc">go</span>

<span class="org-comment">--SET QUOTED_IDENTIFIER ON|OFF</span>
<span class="org-comment">--SET ANSI_NULLS ON|OFF</span>
<span class="org-comment">--go$0</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org329a978" class="outline-5">
<h5 id="org329a978">[ap] Alter Procedure</h5>
<div class="outline-text-5" id="text-org329a978">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">ALTER</span> <span class="org-keyword">PROCEDURE</span>
# <span class="org-comment">--</span>
<span class="org-keyword">ALTER</span> <span class="org-keyword">PROCEDURE</span> $0
</pre>
</div>
</div>
</div>

<div id="outline-container-org39f16c5" class="outline-5">
<h5 id="org39f16c5">[dp] Drop Procedure</h5>
<div class="outline-text-5" id="text-org39f16c5">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">Drop</span> stored <span class="org-keyword">procedure</span>
# <span class="org-comment">--</span>
<span class="org-keyword">DROP</span> <span class="org-keyword">PROCEDURE</span> $0
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org638f01f" class="outline-4">
<h4 id="org638f01f">Synonym</h4>
<div class="outline-text-4" id="text-org638f01f">
</div>
<div id="outline-container-org8535c08" class="outline-5">
<h5 id="org8535c08">Create Synonym</h5>
<div class="outline-text-5" id="text-org8535c08">
<p>
Creates a synonym.
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">CREATE</span> SYNONYM ${1:[<span class="org-keyword">schema</span>].[synonym_name]}
<span class="org-keyword">FOR</span> ${2:[<span class="org-keyword">schema</span>].[<span class="org-builtin">object_name</span>]};
<span class="org-doc">go$0</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org20bef56" class="outline-4">
<h4 id="org20bef56">Table</h4>
<div class="outline-text-4" id="text-org20bef56">
</div>
<div id="outline-container-org49e9898" class="outline-5">
<h5 id="org49e9898">[ct] Create Table (crt)</h5>
<div class="outline-text-5" id="text-org49e9898">
<p>
Creates a table (and drop previous one with the same name).
</p>

<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">Create</span> <span class="org-keyword">table</span>
# <span class="org-comment">--</span>
<span class="org-keyword">IF</span> <span class="org-builtin">OBJECT_ID</span> (<span class="org-string">'${1:[schema].[table_name]}'</span>, <span class="org-string">'U'</span>) <span class="org-keyword">IS</span> <span class="org-keyword">NOT</span> <span class="org-keyword">NULL</span>
    <span class="org-keyword">DROP</span> <span class="org-keyword">TABLE</span> $1;
<span class="org-doc">go</span>

<span class="org-keyword">CREATE</span> <span class="org-keyword">TABLE</span> $1
(
    ${2:column_1} ${3:data_type_1} ${4:column_nullability_1},
    ${5:column_2} ${6:data_type_2} ${5:column_nullability_2},$0
    <span class="org-keyword">CONSTRAINT</span> <span class="org-comment-delimiter">/* </span><span class="org-comment">contraint_name */</span> <span class="org-keyword">PRIMARY</span> <span class="org-keyword">KEY</span> (<span class="org-comment-delimiter">/* </span><span class="org-comment">columns_in_primary_key */</span>)
);
<span class="org-doc">go</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org756d7b2" class="outline-5">
<h5 id="org756d7b2">[ctt] Create Temporary Table (crtt)</h5>
<div class="outline-text-5" id="text-org756d7b2">
<p>
Creates a temporary table.
</p>

<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">Create</span> <span class="org-keyword">temp</span> <span class="org-keyword">table</span>
# <span class="org-comment">--</span>
<span class="org-keyword">CREATE</span> <span class="org-keyword">TABLE</span> #<span class="org-keyword">temp</span>
(
    $0
);
<span class="org-doc">go</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga33f37d" class="outline-5">
<h5 id="orga33f37d">[ctv] Create Table Variable (crtv)</h5>
<div class="outline-text-5" id="text-orga33f37d">
<p>
Creates a table variable.
</p>

<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">Create</span> <span class="org-keyword">table</span> <span class="org-builtin">var</span>
# <span class="org-comment">--</span>
<span class="org-keyword">DECLARE</span> <span class="org-variable-name">@tbl</span> <span class="org-keyword">TABLE</span>
(
    $0
)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgba55b80" class="outline-5">
<h5 id="orgba55b80">[at] Alter Table fragment</h5>
<div class="outline-text-5" id="text-orgba55b80">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">ALTER</span> <span class="org-keyword">TABLE</span> fragm...
# <span class="org-comment">--</span>
<span class="org-keyword">ALTER</span> <span class="org-keyword">TABLE</span> $0
</pre>
</div>
</div>
</div>

<div id="outline-container-org3f3e153" class="outline-5">
<h5 id="org3f3e153">[ata] Add Column</h5>
<div class="outline-text-5" id="text-org3f3e153">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">Add</span> <span class="org-keyword">column</span>
# <span class="org-comment">--</span>
<span class="org-comment">-- Add a new column to the table.</span>
<span class="org-keyword">ALTER</span> <span class="org-keyword">TABLE</span> ${1:[<span class="org-keyword">schema</span>].[<span class="org-keyword">table_name</span>]}
    <span class="org-keyword">ADD</span> [${2:new_column_name}] ${3:data_type} ${4:new_column_nullability};
<span class="org-doc">go$0</span>
</pre>
</div>
</div>
</div>
