README.org
**** [atac] Modify Column

#+begin_warning
Running ~ALTER COLUMN~ without mentioning attribute ~NOT NULL~ will result in the
column being changed to *nullable*, if it is already not.
#+end_warning

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/atac.yasnippet
# name: Modify column
# --
-- WARNING: If the column is not nullable, specify attribute NOT NULL.
ALTER TABLE ${1:[schema].[table_name]}
    ALTER COLUMN $0;
go
#+end_src

**** [atd] Drop column

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/atd.yasnippet
# name: Drop column
# --
-- Drop a column from the table.
ALTER TABLE ${1:[schema].[table_name]}
    DROP COLUMN $0;
go
#+end_src

**** [crc] Add Constraint

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/crc.yasnippet
# name: Add constraint
# --
ALTER TABLE ${1:[schema].[table_name]}
    ADD CONSTRAINT ${2:constraint_name};
go
#+end_src

**** [atdc] Drop Constraint

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/atdc.yasnippet
# name: Drop constraint
# --
ALTER TABLE ${1:[schema].[table_name]}
    DROP CONSTRAINT ${2:constraint_name};
go
#+end_src

**** [dt] Drop Table

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/dt.yasnippet
# name: Drop table
# --
IF EXISTS (SELECT *
             FROM sys.tables
             JOIN sys.schemas
               ON sys.tables.schema_id = sys.schemas.schema_id
            WHERE sys.schemas.name = N'${1:schema}'
              AND sys.tables.name = N'${2:table}')
    DROP TABLE $1.$2
go
#+end_src

*** Transaction

**** [bt] Begin Transaction

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/bt.yasnippet
# name: Begin transaction
# --
BEGIN TRANSACTION $0
#+end_src

**** [ctr] Commit Transaction

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/ctr.yasnippet
# name: Commit transaction
# --
COMMIT TRANSACTION $0
#+end_src

**** [rt] Rollback Transaction

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/rt.yasnippet
# name: Rollback transaction
# --
ROLLBACK TRANSACTION $0
#+end_src

*** Trigger

**** Create Trigger

Creates a trigger.

#+begin_src sql :tangle no
# name: Create trigger
# --
IF OBJECT_ID ('${1:trigger_name}', 'TR') IS NOT NULL
    DROP TRIGGER $1;
go

-- =============================================
SET ANSI_NULLS ON
go
SET QUOTED_IDENTIFIER ON
go
-- =============================================
-- Author:      /* Author */
-- Create date: /* Create Date */
-- Description: /* Description */
-- =============================================
CREATE TRIGGER $1
ON ${2:[schema].[table_name]}
FOR INSERT, UPDATE, DELETE
AS
BEGIN
    -- SET NOCOUNT ON added to prevent extra result sets from
    -- interfering with SELECT statements.
    SET NOCOUNT ON;

    -- Insert statements for trigger here
    RAISERROR (50009, 16, 10)
    $0
END;
go
#+end_src

**** Enable Trigger

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/atet.yasnippet
# name: Enable trigger
# --
ALTER TABLE ${1:[schema].[table_name]} ENABLE TRIGGER $0;
#+end_src

**** Enable All Triggers

Enable all triggers on table.

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/ateta.yasnippet
# name: Enable all triggers on...
# --
ALTER TABLE ${1:[schema].[table_name]}$0 ENABLE TRIGGER ALL;
go
#+end_src

**** Disable Trigger

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/atdt.yasnippet
# name: Disable trigger
# --
ALTER TABLE ${1:[schema].[table_name]} DISABLE TRIGGER $0;
#+end_src

**** Disable All Triggers

Disable all triggers on table.

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/atdta.yasnippet
# name: Disable all triggers on...
# --
ALTER TABLE ${1:[schema].[table_name]}$0 DISABLE TRIGGER ALL;
go
#+end_src

*** User

