README.html

<div id="outline-container-org5b4aa43" class="outline-5">
<h5 id="org5b4aa43">[atac] Modify Column</h5>
<div class="outline-text-5" id="text-org5b4aa43">
<div class="warning">
<p>
Running <code>ALTER COLUMN</code> without mentioning attribute <code>NOT NULL</code> will result in the
column being changed to <b>nullable</b>, if it is already not.
</p>

</div>

<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">Modify</span> <span class="org-keyword">column</span>
# <span class="org-comment">--</span>
<span class="org-comment">-- WARNING: If the column is not nullable, specify attribute NOT NULL.</span>
<span class="org-keyword">ALTER</span> <span class="org-keyword">TABLE</span> ${1:[<span class="org-keyword">schema</span>].[<span class="org-keyword">table_name</span>]}
    <span class="org-keyword">ALTER</span> <span class="org-keyword">COLUMN</span> $0;
<span class="org-doc">go</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9c81a26" class="outline-5">
<h5 id="org9c81a26">[atd] Drop column</h5>
<div class="outline-text-5" id="text-org9c81a26">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">Drop</span> <span class="org-keyword">column</span>
# <span class="org-comment">--</span>
<span class="org-comment">-- Drop a column from the table.</span>
<span class="org-keyword">ALTER</span> <span class="org-keyword">TABLE</span> ${1:[<span class="org-keyword">schema</span>].[<span class="org-keyword">table_name</span>]}
    <span class="org-keyword">DROP</span> <span class="org-keyword">COLUMN</span> $0;
<span class="org-doc">go</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org356989d" class="outline-5">
<h5 id="org356989d">[crc] Add Constraint</h5>
<div class="outline-text-5" id="text-org356989d">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">Add</span> <span class="org-keyword">constraint</span>
# <span class="org-comment">--</span>
<span class="org-keyword">ALTER</span> <span class="org-keyword">TABLE</span> ${1:[<span class="org-keyword">schema</span>].[<span class="org-keyword">table_name</span>]}
    <span class="org-keyword">ADD</span> <span class="org-keyword">CONSTRAINT</span> ${2:<span class="org-keyword">constraint_name</span>};
<span class="org-doc">go</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc1fd06b" class="outline-5">
<h5 id="orgc1fd06b">[atdc] Drop Constraint</h5>
<div class="outline-text-5" id="text-orgc1fd06b">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">Drop</span> <span class="org-keyword">constraint</span>
# <span class="org-comment">--</span>
<span class="org-keyword">ALTER</span> <span class="org-keyword">TABLE</span> ${1:[<span class="org-keyword">schema</span>].[<span class="org-keyword">table_name</span>]}
    <span class="org-keyword">DROP</span> <span class="org-keyword">CONSTRAINT</span> ${2:<span class="org-keyword">constraint_name</span>};
<span class="org-doc">go</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org91d8c43" class="outline-5">
<h5 id="org91d8c43">[dt] Drop Table</h5>
<div class="outline-text-5" id="text-org91d8c43">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">Drop</span> <span class="org-keyword">table</span>
# <span class="org-comment">--</span>
<span class="org-keyword">IF</span> <span class="org-keyword">EXISTS</span> (<span class="org-keyword">SELECT</span> *
             <span class="org-keyword">FROM</span> sys.tables
             <span class="org-keyword">JOIN</span> sys.schemas
               <span class="org-keyword">ON</span> sys.tables.schema_id = sys.schemas.schema_id
            <span class="org-keyword">WHERE</span> sys.schemas.<span class="org-keyword">name</span> = N<span class="org-string">'${1:schema}'</span>
              <span class="org-keyword">AND</span> sys.tables.<span class="org-keyword">name</span> = N<span class="org-string">'${2:table}'</span>)
    <span class="org-keyword">DROP</span> <span class="org-keyword">TABLE</span> $1.$2
<span class="org-doc">go</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb9c5182" class="outline-4">
<h4 id="orgb9c5182">Transaction</h4>
<div class="outline-text-4" id="text-orgb9c5182">
</div>
<div id="outline-container-org333ac9c" class="outline-5">
<h5 id="org333ac9c">[bt] Begin Transaction</h5>
<div class="outline-text-5" id="text-org333ac9c">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">Begin</span> <span class="org-keyword">transaction</span>
# <span class="org-comment">--</span>
<span class="org-keyword">BEGIN</span> <span class="org-keyword">TRANSACTION</span> $0
</pre>
</div>
</div>
</div>

<div id="outline-container-org05a9551" class="outline-5">
<h5 id="org05a9551">[ctr] Commit Transaction</h5>
<div class="outline-text-5" id="text-org05a9551">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">Commit</span> <span class="org-keyword">transaction</span>
# <span class="org-comment">--</span>
<span class="org-keyword">COMMIT</span> <span class="org-keyword">TRANSACTION</span> $0
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf088b28" class="outline-5">
<h5 id="orgf088b28">[rt] Rollback Transaction</h5>
<div class="outline-text-5" id="text-orgf088b28">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">Rollback</span> <span class="org-keyword">transaction</span>
# <span class="org-comment">--</span>
<span class="org-keyword">ROLLBACK</span> <span class="org-keyword">TRANSACTION</span> $0
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org964ea6c" class="outline-4">
<h4 id="org964ea6c">Trigger</h4>
<div class="outline-text-4" id="text-org964ea6c">
</div>
<div id="outline-container-org3822cd8" class="outline-5">
<h5 id="org3822cd8">Create Trigger</h5>
<div class="outline-text-5" id="text-org3822cd8">
<p>
Creates a trigger.
</p>

<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">Create</span> <span class="org-keyword">trigger</span>
# <span class="org-comment">--</span>
<span class="org-keyword">IF</span> <span class="org-builtin">OBJECT_ID</span> (<span class="org-string">'${1:trigger_name}'</span>, <span class="org-string">'TR'</span>) <span class="org-keyword">IS</span> <span class="org-keyword">NOT</span> <span class="org-keyword">NULL</span>
    <span class="org-keyword">DROP</span> <span class="org-keyword">TRIGGER</span> $1;
<span class="org-doc">go</span>

<span class="org-comment">-- =============================================</span>
<span class="org-doc">SET ANSI_NULLS ON</span>
<span class="org-doc">go</span>
<span class="org-doc">SET QUOTED_IDENTIFIER ON</span>
<span class="org-doc">go</span>
<span class="org-comment">-- =============================================</span>
<span class="org-comment">-- Author:      /* Author */</span>
<span class="org-comment">-- Create date: /* Create Date */</span>
<span class="org-comment">-- Description: /* Description */</span>
<span class="org-comment">-- =============================================</span>
<span class="org-keyword">CREATE</span> <span class="org-keyword">TRIGGER</span> $1
<span class="org-keyword">ON</span> ${2:[<span class="org-keyword">schema</span>].[<span class="org-keyword">table_name</span>]}
<span class="org-keyword">FOR</span> <span class="org-keyword">INSERT</span>, <span class="org-keyword">UPDATE</span>, <span class="org-keyword">DELETE</span>
<span class="org-keyword">AS</span>
<span class="org-keyword">BEGIN</span>
    <span class="org-comment">-- SET NOCOUNT ON added to prevent extra result sets from</span>
    <span class="org-comment">-- interfering with SELECT statements.</span>
    <span class="org-keyword">SET</span> NOCOUNT <span class="org-keyword">ON</span>;

    <span class="org-comment">-- Insert statements for trigger here</span>
    <span class="org-keyword">RAISERROR</span> (50009, 16, 10)
    $0
<span class="org-keyword">END</span>;
<span class="org-doc">go</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge651767" class="outline-5">
<h5 id="orge651767">Enable Trigger</h5>
<div class="outline-text-5" id="text-orge651767">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: Enable <span class="org-keyword">trigger</span>
# <span class="org-comment">--</span>
<span class="org-keyword">ALTER</span> <span class="org-keyword">TABLE</span> ${1:[<span class="org-keyword">schema</span>].[<span class="org-keyword">table_name</span>]} ENABLE <span class="org-keyword">TRIGGER</span> $0;
</pre>
</div>
</div>
</div>

<div id="outline-container-org91786cb" class="outline-5">
<h5 id="org91786cb">Enable All Triggers</h5>
<div class="outline-text-5" id="text-org91786cb">
<p>
Enable all triggers on table.
</p>

<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: Enable <span class="org-keyword">all</span> triggers <span class="org-keyword">on</span>...
# <span class="org-comment">--</span>
<span class="org-keyword">ALTER</span> <span class="org-keyword">TABLE</span> ${1:[<span class="org-keyword">schema</span>].[<span class="org-keyword">table_name</span>]}$0 ENABLE <span class="org-keyword">TRIGGER</span> <span class="org-keyword">ALL</span>;
<span class="org-doc">go</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1336bf8" class="outline-5">
<h5 id="org1336bf8">Disable Trigger</h5>
<div class="outline-text-5" id="text-org1336bf8">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: Disable <span class="org-keyword">trigger</span>
# <span class="org-comment">--</span>
<span class="org-keyword">ALTER</span> <span class="org-keyword">TABLE</span> ${1:[<span class="org-keyword">schema</span>].[<span class="org-keyword">table_name</span>]} DISABLE <span class="org-keyword">TRIGGER</span> $0;
</pre>
</div>
</div>
</div>

<div id="outline-container-org35939e5" class="outline-5">
<h5 id="org35939e5">Disable All Triggers</h5>
<div class="outline-text-5" id="text-org35939e5">
<p>
Disable all triggers on table.
</p>

<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: Disable <span class="org-keyword">all</span> triggers <span class="org-keyword">on</span>...
