README.org
**** [cu] Create User

Creates a database user.

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/cu.yasnippet
# name: Create database user
# --
CREATE USER ${1:UserName}$0
FOR /* FROM */ LOGIN /* login_name */
--  CERTIFICATE certificate_name
--  ASYMMETRIC KEY key_name
--  WITHOUT LOGIN
--  WITH DEFAULT_SCHEMA = schema_name
go
#+end_src

**** [du] Drop User

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/du.yasnippet
# name: Drop user
# --
DROP USER ${1:user_name}
go
#+end_src

*** User Defined Data Type

**** Create User-Defined Data Type

Creates a user-defined data type.

#+begin_src sql :tangle no
CREATE TYPE ${1:[schema].[my_data_type]}
FROM ${2:data_type} ${3:column_nullability}
#+end_src

*** User Defined Table Type

**** Create User-Defined Table Type

Creates a user-defined table type.

#+begin_src sql :tangle no
CREATE TYPE ${1:[schema].[my_table_type]} AS TABLE
(
    ${2:column_1} ${3:data_type_1},
    ${4:column_2} ${5:data_type_2}
);
go$0
#+end_src

*** User Defined Type

**** Create User-Defined Type

Creates a CLR integration user-defined type.

#+begin_src sql :tangle no
CREATE TYPE ${1:Utf8String}
EXTERNAL NAME ${2:utf8string}.${3:[Microsoft.Samples.SqlServer.utf8string]};
go$0
#+end_src

*** View

**** [cv] Create View

Creates a view.

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/cv.yasnippet
# name: Create view
# --
IF OBJECT_ID ('${1:[schema].[view_name]}', 'V') IS NOT NULL
    DROP VIEW $1;
go

CREATE VIEW $1
--WITH ENCRYPTION, SCHEMABINDING, VIEW_METADATA
AS
    SELECT *
    FROM ${2:[schema].[sample_table]}
    $0
-- WITH CHECK OPTION
go
#+end_src

**** [dv] Drop View

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/dv.yasnippet
# name: Drop view
# --
DROP VIEW $0
#+end_src

*** --- Miscellaneous ---

**** [e] Execute

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/e.yasnippet
# name: EXECUTE fragment
# --
EXECUTE
#+end_src

**** [sph] sp_help

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/sph.yasnippet
# name: Execute sp_help
# --
EXEC sp_help$0
#+end_src

**** [spt] sp_helptext

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/spt.yasnippet
# name: Execute sp_helptext
# --
EXEC sp_helptext$0
#+end_src

**** [xpfd] xp_fixeddrives

Retrieve free space on all fixed drives.

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/xpfd.yasnippet
# name: Retrieve free space o...
# --
EXEC master..xp_fixeddrives
#+end_src

**** [w2] Who2

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/w2.yasnippet
# name: Execute sp_who2$0
# --
EXEC sp_who2$0
#+end_src

**** [err] @@ERROR

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/err.yasnippet
# name: @@ERROR function ...
# --
@@ERROR$0
#+end_src

**** [mro] Most Recent Objects

Retrieve 20 most recently created objects.

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/mro.yasnippet
# name: Retrieve 20 most rec...
# --
SELECT TOP 20 [name], [type], crdate
FROM sysobjects
ORDER BY crdate DESC
#+end_src

**** Comment

A comment block.

#+begin_src sql :tangle no
/*
 * $0
 */
#+end_src

**** Comment

A multiline comment block.

#+begin_src sql :tangle no
/*******************************************
 * $0
 *******************************************/
#+end_src

** Surround With...

*** [begin] Code Snippet for BEGIN...END block

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/begin.yasnippet
# name: Surround with BEGIN...
# --
BEGIN
`yas-selected-text`
END
#+end_src

*** [if] Code Snippet for IF construct

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/if.yasnippet
# name: Surround with IF...
# --
IF (${1:Condition})
BEGIN
`yas-selected-text`
END
 #+end_src

