README.html
# <span class="org-comment">--</span>
<span class="org-keyword">ALTER</span> <span class="org-keyword">TABLE</span> ${1:[<span class="org-keyword">schema</span>].[<span class="org-keyword">table_name</span>]}$0 DISABLE <span class="org-keyword">TRIGGER</span> <span class="org-keyword">ALL</span>;
<span class="org-doc">go</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2dcb173" class="outline-4">
<h4 id="org2dcb173">User</h4>
<div class="outline-text-4" id="text-org2dcb173">
</div>
<div id="outline-container-org6dfa999" class="outline-5">
<h5 id="org6dfa999">[cu] Create User</h5>
<div class="outline-text-5" id="text-org6dfa999">
<p>
Creates a database user.
</p>

<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">Create</span> <span class="org-keyword">database</span> <span class="org-keyword">user</span>
# <span class="org-comment">--</span>
<span class="org-keyword">CREATE</span> <span class="org-keyword">USER</span> ${1:UserName}$0
<span class="org-keyword">FOR</span> <span class="org-comment-delimiter">/* </span><span class="org-comment">FROM */</span> LOGIN <span class="org-comment-delimiter">/* </span><span class="org-comment">login_name */</span>
<span class="org-comment">--  CERTIFICATE certificate_name</span>
<span class="org-comment">--  ASYMMETRIC KEY key_name</span>
<span class="org-comment">--  WITHOUT LOGIN</span>
<span class="org-comment">--  WITH DEFAULT_SCHEMA = schema_name</span>
<span class="org-doc">go</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org36e8d7a" class="outline-5">
<h5 id="org36e8d7a">[du] Drop User</h5>
<div class="outline-text-5" id="text-org36e8d7a">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">Drop</span> <span class="org-keyword">user</span>
# <span class="org-comment">--</span>
<span class="org-keyword">DROP</span> <span class="org-keyword">USER</span> ${1:<span class="org-builtin">user_name</span>}
<span class="org-doc">go</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org397641b" class="outline-4">
<h4 id="org397641b">User Defined Data Type</h4>
<div class="outline-text-4" id="text-org397641b">
</div>
<div id="outline-container-org66577a1" class="outline-5">
<h5 id="org66577a1">Create User-Defined Data Type</h5>
<div class="outline-text-5" id="text-org66577a1">
<p>
Creates a user-defined data type.
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">CREATE</span> <span class="org-keyword">TYPE</span> ${1:[<span class="org-keyword">schema</span>].[my_data_type]}
<span class="org-keyword">FROM</span> ${2:data_type} ${3:column_nullability}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgefbf7c6" class="outline-4">
<h4 id="orgefbf7c6">User Defined Table Type</h4>
<div class="outline-text-4" id="text-orgefbf7c6">
</div>
<div id="outline-container-org1fb1f39" class="outline-5">
<h5 id="org1fb1f39">Create User-Defined Table Type</h5>
<div class="outline-text-5" id="text-org1fb1f39">
<p>
Creates a user-defined table type.
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">CREATE</span> <span class="org-keyword">TYPE</span> ${1:[<span class="org-keyword">schema</span>].[my_table_type]} <span class="org-keyword">AS</span> <span class="org-keyword">TABLE</span>
(
    ${2:column_1} ${3:data_type_1},
    ${4:column_2} ${5:data_type_2}
);
<span class="org-doc">go$0</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org96565f0" class="outline-4">
<h4 id="org96565f0">User Defined Type</h4>
<div class="outline-text-4" id="text-org96565f0">
</div>
<div id="outline-container-orgd9fb33d" class="outline-5">
<h5 id="orgd9fb33d">Create User-Defined Type</h5>
<div class="outline-text-5" id="text-orgd9fb33d">
<p>
Creates a CLR integration user-defined type.
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-keyword">CREATE</span> <span class="org-keyword">TYPE</span> ${1:Utf8String}
<span class="org-keyword">EXTERNAL</span> <span class="org-keyword">NAME</span> ${2:utf8string}.${3:[Microsoft.Samples.SqlServer.utf8string]};
<span class="org-doc">go$0</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org1e593f2" class="outline-4">
<h4 id="org1e593f2">View</h4>
<div class="outline-text-4" id="text-org1e593f2">
</div>
<div id="outline-container-org35298b3" class="outline-5">
<h5 id="org35298b3">[cv] Create View</h5>
<div class="outline-text-5" id="text-org35298b3">
<p>
Creates a view.
</p>

<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">Create</span> <span class="org-keyword">view</span>
# <span class="org-comment">--</span>
<span class="org-keyword">IF</span> <span class="org-builtin">OBJECT_ID</span> (<span class="org-string">'${1:[schema].[view_name]}'</span>, <span class="org-string">'V'</span>) <span class="org-keyword">IS</span> <span class="org-keyword">NOT</span> <span class="org-keyword">NULL</span>
    <span class="org-keyword">DROP</span> <span class="org-keyword">VIEW</span> $1;
<span class="org-doc">go</span>

<span class="org-keyword">CREATE</span> <span class="org-keyword">VIEW</span> $1
<span class="org-comment">--WITH ENCRYPTION, SCHEMABINDING, VIEW_METADATA</span>
<span class="org-keyword">AS</span>
    <span class="org-keyword">SELECT</span> *
    <span class="org-keyword">FROM</span> ${2:[<span class="org-keyword">schema</span>].[sample_table]}
    $0
<span class="org-comment">-- WITH CHECK OPTION</span>
<span class="org-doc">go</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd038bc0" class="outline-5">
<h5 id="orgd038bc0">[dv] Drop View</h5>
<div class="outline-text-5" id="text-orgd038bc0">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">Drop</span> <span class="org-keyword">view</span>
# <span class="org-comment">--</span>
<span class="org-keyword">DROP</span> <span class="org-keyword">VIEW</span> $0
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb57a7fb" class="outline-4">
<h4 id="orgb57a7fb">&#x2014; Miscellaneous ---</h4>
<div class="outline-text-4" id="text-orgb57a7fb">
</div>
<div id="outline-container-orgdc27990" class="outline-5">
<h5 id="orgdc27990">[e] Execute</h5>
<div class="outline-text-5" id="text-orgdc27990">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">EXECUTE</span> fragment
# <span class="org-comment">--</span>
<span class="org-keyword">EXECUTE</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc78a651" class="outline-5">
<h5 id="orgc78a651">[sph] sp_help</h5>
<div class="outline-text-5" id="text-orgc78a651">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">Execute</span> sp_help
# <span class="org-comment">--</span>
<span class="org-keyword">EXEC</span> sp_help$0
</pre>
</div>
</div>
</div>

<div id="outline-container-org67722b4" class="outline-5">
<h5 id="org67722b4">[spt] sp_helptext</h5>
<div class="outline-text-5" id="text-org67722b4">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">Execute</span> sp_helptext
# <span class="org-comment">--</span>
<span class="org-keyword">EXEC</span> sp_helptext$0
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf455274" class="outline-5">
<h5 id="orgf455274">[xpfd] xp_fixeddrives</h5>
<div class="outline-text-5" id="text-orgf455274">
<p>
Retrieve free space on all fixed drives.
</p>

<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: Retrieve <span class="org-keyword">free</span> <span class="org-builtin">space</span> o...
# <span class="org-comment">--</span>
<span class="org-keyword">EXEC</span> master..xp_fixeddrives
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdd810c9" class="outline-5">
<h5 id="orgdd810c9">[w2] Who2</h5>
<div class="outline-text-5" id="text-orgdd810c9">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-keyword">Execute</span> sp_who2$0
# <span class="org-comment">--</span>
<span class="org-keyword">EXEC</span> sp_who2$0
</pre>
</div>
</div>
</div>

<div id="outline-container-org070ce01" class="outline-5">
<h5 id="org070ce01">[err] @@ERROR</h5>
<div class="outline-text-5" id="text-org070ce01">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: <span class="org-builtin">@@ERROR</span> <span class="org-keyword">function</span> ...
# <span class="org-comment">--</span>
<span class="org-builtin">@@ERROR</span>$0
</pre>
</div>
</div>
</div>

<div id="outline-container-org7bda824" class="outline-5">
<h5 id="org7bda824">[mro] Most Recent Objects</h5>
<div class="outline-text-5" id="text-org7bda824">
<p>
Retrieve 20 most recently created objects.
</p>

<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: Retrieve 20 most rec...
# <span class="org-comment">--</span>
<span class="org-keyword">SELECT</span> <span class="org-keyword">TOP</span> 20 [<span class="org-keyword">name</span>], [<span class="org-keyword">type</span>], crdate
<span class="org-keyword">FROM</span> sysobjects
<span class="org-keyword">ORDER</span> <span class="org-keyword">BY</span> crdate <span class="org-keyword">DESC</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org97db5f2" class="outline-5">
<h5 id="org97db5f2">Comment</h5>
<div class="outline-text-5" id="text-org97db5f2">
<p>
A comment block.
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-comment-delimiter">/*</span>
<span class="org-comment"> * $0</span>
<span class="org-comment"> */</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaef0df1" class="outline-5">
<h5 id="orgaef0df1">Comment</h5>
<div class="outline-text-5" id="text-orgaef0df1">
<p>
A multiline comment block.
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="org-comment-delimiter">/*******************************************</span>
<span class="org-comment"> * $0</span>
<span class="org-comment"> *******************************************/</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd5ec54c" class="outline-3">
<h3 id="orgd5ec54c">Surround With&#x2026;</h3>
<div class="outline-text-3" id="text-orgd5ec54c">
</div>
<div id="outline-container-org29f6f4d" class="outline-4">
<h4 id="org29f6f4d">[begin] Code Snippet for BEGIN&#x2026;END block</h4>
<div class="outline-text-4" id="text-org29f6f4d">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: Surround <span class="org-keyword">with</span> <span class="org-keyword">BEGIN</span>...
# <span class="org-comment">--</span>
<span class="org-keyword">BEGIN</span>
`yas-selected-<span class="org-type">text</span>`
<span class="org-keyword">END</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga446a03" class="outline-4">
<h4 id="orga446a03">[if] Code Snippet for IF construct</h4>
<div class="outline-text-4" id="text-orga446a03">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: Surround <span class="org-keyword">with</span> <span class="org-keyword">IF</span>...
