README.org
*** [while] Code Snippet for WHILE loop

#+begin_src sql :tangle ~/.emacs.d/snippets/sql-mode/while.yasnippet
# name: Surround with WHILE...
# --
WHILE (${1:Condition})
BEGIN
`yas-selected-text`
END
 #+end_src
