README.html
# <span class="org-comment">--</span>
<span class="org-keyword">IF</span> (${1:Condition})
<span class="org-keyword">BEGIN</span>
`yas-selected-<span class="org-type">text</span>`
<span class="org-keyword">END</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc1c6489" class="outline-4">
<h4 id="orgc1c6489">[while] Code Snippet for WHILE loop</h4>
<div class="outline-text-4" id="text-orgc1c6489">
<div class="org-src-container">
<pre class="src src-sql"># <span class="org-keyword">name</span>: Surround <span class="org-keyword">with</span> <span class="org-keyword">WHILE</span>...
# <span class="org-comment">--</span>
<span class="org-keyword">WHILE</span> (${1:Condition})
<span class="org-keyword">BEGIN</span>
`yas-selected-<span class="org-type">text</span>`
<span class="org-keyword">END</span>
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Fabrice Niessen</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
